ruuvi/ruuvi.gateway_esp.c/tests/test_nrf52fw/test_nrf52fw.cpp
/**
 * @file test_bin2hex.cpp
 * @author TheSomeMan
 * @date 2020-08-27
 * @copyright Ruuvi Innovations Ltd, license BSD-3-Clause.
 */

#include "nrf52fw.h"
#include <string>
#include <list>
#include <sys/stat.h>
#include <ftw.h>
#include "gtest/gtest.h"
#include "esp_log_wrapper.hpp"
#include "esp_err.h"
#include "esp_vfs_fat.h"
#include "esp32/rom/crc.h"
#include "freertos/FreeRTOS.h"
#include "os_task.h"

using namespace std;

/*** Google-test class implementation
 * *********************************************************************************/

struct FlashFatFs_Tag
{
    int stub;
};

class TestNRF52Fw;
static TestNRF52Fw* g_pTestClass;

class NRF52Fw_VFS_FAT_MountInfo
{
public:
    string                     base_path;
    string                     partition_label;
    esp_vfs_fat_mount_config_t mount_config    = {};
    bool                       flag_mounted    = false;
    esp_err_t                  mount_err       = ESP_OK;
    esp_err_t                  unmount_err     = ESP_OK;
    wl_handle_t                wl_handle       = 0;
    esp_err_t                  mount_raw_err   = ESP_OK;
    esp_err_t                  unmount_raw_err = ESP_OK;
};

class MemAllocTrace
{
    vector<void*> allocated_mem;

    std::vector<void*>::iterator
    find(void* ptr)
    {
        for (auto iter = this->allocated_mem.begin(); iter != this->allocated_mem.end(); ++iter)
        {
            if (*iter == ptr)
            {
                return iter;
            }
        }
        return this->allocated_mem.end();
    }

public:
    void
    add(void* ptr)
    {
        auto iter = find(ptr);
        assert(iter == this->allocated_mem.end()); // ptr was found in the list of allocated memory blocks
        this->allocated_mem.push_back(ptr);
    }
    void
    remove(void* ptr)
    {
        auto iter = find(ptr);
        assert(iter != this->allocated_mem.end()); // ptr was not found in the list of allocated memory blocks
        this->allocated_mem.erase(iter);
    }
    bool
    is_empty()
    {
        return this->allocated_mem.empty();
    }
};

class ProgressInfo
{
public:
    size_t      num_bytes_flashed;
    size_t      total_size;
    void* const p_param;
};

class MemSegment
{
public:
    uint32_t         segmentAddr;
    vector<uint32_t> data;

    MemSegment(const uint32_t addr, const uint32_t num_words, const uint32_t* p_buf)
        : segmentAddr(addr)
    {
        for (uint32_t i = 0; i < num_words; ++i)
        {
            this->data.push_back(p_buf[i]);
        }
    }

    void
    append(const uint32_t addr, const uint32_t num_words, const uint32_t* p_buf)
    {
        const uint32_t segmentEndAddr = this->segmentAddr + this->data.size() * sizeof(uint32_t);
        assert(addr == segmentEndAddr);
        for (uint32_t i = 0; i < num_words; ++i)
        {
            this->data.push_back(p_buf[i]);
        }
    }
};

static int
remove_file(const char* filename, const struct stat* status, int flag, struct FTW* p_info)
{
    return remove(filename);
}

static void
remove_dir_with_files(const char* path)
{
    struct stat st = { 0 };
    if (stat(path, &st) == 0)
    {
        if (S_ISDIR(st.st_mode))
        {
            const int res = nftw(path, remove_file, 10, FTW_DEPTH | FTW_MOUNT | FTW_PHYS);
            assert(0 == res);
        }
        else
        {
            const int res = remove(path);
            assert(0 == res);
        }
    }
}

class TestNRF52Fw : public ::testing::Test
{
private:
protected:
    FILE*                 m_fd;
    const flash_fat_fs_t* m_p_ffs;
    const char*           m_mount_point_dir;
    const char*           m_mount_point;
    const char*           m_info_txt_name;

    void
    SetUp() override
    {
#define FS_NRF52_MOUNT_POINT "fs_nrf52"
        this->m_mount_point_dir = FS_NRF52_MOUNT_POINT;
        this->m_mount_point     = "/" FS_NRF52_MOUNT_POINT;
        this->m_info_txt_name   = "info.txt";
        {
            remove_dir_with_files(this->m_mount_point_dir);
            mkdir(this->m_mount_point_dir, 0700);
        }
        this->m_fd    = nullptr;
        this->m_p_ffs = nullptr;
        this->m_progress.clear();
        esp_log_wrapper_init();
        g_pTestClass = this;

        this->m_malloc_cnt                                      = 0;
        this->m_malloc_fail_on_cnt                              = 0;
        this->m_result_nrf52swd_init                            = true;
        this->m_result_nrf52swd_check_id_code                   = true;
        this->m_result_nrf52swd_debug_halt                      = true;
        this->m_result_nrf52swd_debug_enable_reset_vector_catch = true;
        this->m_result_nrf52swd_debug_reset                     = true;
        this->m_result_nrf52swd_debug_run                       = true;
        this->m_result_nrf52swd_erase_all                       = true;
        this->m_cnt_nrf52swd_erase_all                          = 0;
        this->m_mount_info.flag_mounted                         = false;
        this->m_mount_info.mount_err                            = ESP_OK;
        this->m_mount_info.unmount_err                          = ESP_OK;
        this->m_mount_info.wl_handle                            = 0;
        this->m_mount_info.mount_raw_err                        = ESP_OK;
        this->m_mount_info.unmount_raw_err                      = ESP_OK;
        this->m_uicr_fw_ver                                     = 0xFFFFFFFFU;
        this->m_uicr_fw_ver_simulate_write_error                = false;
        this->m_uicr_fw_ver_simulate_read_error                 = false;
        this->m_uicr_fw_ver_num_reads_before_error              = 0;
    }

    void
    TearDown() override
    {
        this->m_progress.clear();
        this->cb_before_updating_cnt = 0;
        this->cb_after_updating_cnt  = 0;
        this->m_memSegmentsRead.clear();
        this->m_memSegmentsWrite.clear();
        nrf52fw_simulate_file_read_error(false);
        if (nullptr != this->m_fd)
        {
            fclose(this->m_fd);
            this->m_fd = nullptr;
        }
        if (nullptr != this->m_p_ffs)
        {
            flashfatfs_unmount(&this->m_p_ffs);
            this->m_p_ffs = nullptr;
        }
        {
            remove_dir_with_files(this->m_mount_point_dir);
        }
        esp_log_wrapper_deinit();
        g_pTestClass = nullptr;
    }

    FILE*
    open_file(const char* file_name, const char* mode)
    {
        char full_path_info_txt[40];
        snprintf(full_path_info_txt, sizeof(full_path_info_txt), "%s/%s", this->m_mount_point_dir, file_name);
        return fopen(full_path_info_txt, mode);
    }

