ruuvi/ruuvi.gateway_esp.c/tests/test_nrf52fw/test_nrf52fw.cpp
public:
    TestNRF52Fw();

    ~TestNRF52Fw() override;

    uint32_t                  m_malloc_cnt;
    uint32_t                  m_malloc_fail_on_cnt;
    bool                      m_result_nrf52swd_init;
    bool                      m_result_nrf52swd_check_id_code;
    bool                      m_result_nrf52swd_debug_halt;
    bool                      m_result_nrf52swd_debug_enable_reset_vector_catch;
    bool                      m_result_nrf52swd_debug_reset;
    bool                      m_result_nrf52swd_debug_run;
    bool                      m_result_nrf52swd_erase_all;
    uint32_t                  m_cnt_nrf52swd_erase_all;
    NRF52Fw_VFS_FAT_MountInfo m_mount_info;
    vector<MemSegment>        m_memSegmentsWrite;
    vector<MemSegment>        m_memSegmentsRead;
    MemAllocTrace             m_mem_alloc_trace;
    list<ProgressInfo>        m_progress;
    uint32_t                  cb_before_updating_cnt;
    uint32_t                  cb_after_updating_cnt;
    uint32_t                  m_uicr_fw_ver;
    bool                      m_uicr_fw_ver_simulate_write_error;
    bool                      m_uicr_fw_ver_simulate_read_error;
    uint32_t                  m_uicr_fw_ver_num_reads_before_error;

    bool
    write_mem(const uint32_t addr, const uint32_t num_words, const uint32_t* p_buf)
    {
        if (NRF52FW_UICR_FW_VER == addr)
        {
            if (1 != num_words)
            {
                return false;
            }
            if (0xFFFFFFFFU != this->m_uicr_fw_ver)
            {
                return false;
            }
            if (this->m_uicr_fw_ver_simulate_write_error)
            {
                return false;
            }
            this->m_uicr_fw_ver = *p_buf;
            return true;
        }
        for (auto& x : this->m_memSegmentsWrite)
        {
            const uint32_t segmentEndAddr = x.segmentAddr + x.data.size() * sizeof(uint32_t);
            const uint32_t endAddr        = addr + num_words * sizeof(uint32_t);
            if (addr == x.segmentAddr)
            {
                return false;
            }
            assert((addr < x.segmentAddr) || (addr >= segmentEndAddr));
            assert((endAddr < x.segmentAddr) || (endAddr >= segmentEndAddr));
            if (addr == segmentEndAddr)
            {
                x.append(addr, num_words, p_buf);
                return true;
            }
        }
        this->m_memSegmentsWrite.emplace_back(addr, num_words, p_buf);
        return true;
    }

    bool
    read_mem(const uint32_t addr, const uint32_t num_words, uint32_t* p_buf)
    {
        assert(0 == (addr % sizeof(uint32_t)));
        if (NRF52FW_UICR_FW_VER == addr)
        {
            if (1 != num_words)
            {
                return false;
            }
            if (this->m_uicr_fw_ver_simulate_read_error)
            {
                return false;
            }
            if (0 != this->m_uicr_fw_ver_num_reads_before_error)
            {
                this->m_uicr_fw_ver_num_reads_before_error -= 1;
                if (0 == this->m_uicr_fw_ver_num_reads_before_error)
                {
                    this->m_uicr_fw_ver_simulate_read_error = true;
                }
            }
            *p_buf = this->m_uicr_fw_ver;
            return true;
        }
        for (const auto& x : this->m_memSegmentsRead)
        {
            const uint32_t segmentEndAddr = x.segmentAddr + x.data.size() * sizeof(uint32_t);
            if ((addr >= x.segmentAddr) && (addr < segmentEndAddr))
            {
                const uint32_t offset = (addr - x.segmentAddr) / sizeof(uint32_t);
                for (uint32_t i = 0; i < num_words; ++i)
                {
                    p_buf[i] = x.data[offset + i];
                }
                return true;
            }
        }
        return false;
    }
};

TestNRF52Fw::TestNRF52Fw()
    : Test()
    , m_progress()
{
}

TestNRF52Fw::~TestNRF52Fw() = default;

extern "C" {

void
gpio_switch_ctrl_activate(void)
{
}

void
gpio_switch_ctrl_deactivate(void)
{
}

bool
nrf52swd_init_gpio_cfg_nreset(void)
{
    return true;
}

const char*
os_task_get_name(void)
{
    static const char g_task_name[] = "main";
    return const_cast<char*>(g_task_name);
}

os_task_priority_t
os_task_get_priority(void)
{
    return 0;
}

void*
os_malloc(const size_t size)
{
    if (++g_pTestClass->m_malloc_cnt == g_pTestClass->m_malloc_fail_on_cnt)
    {
        return nullptr;
    }
    void* ptr = malloc(size);
    assert(nullptr != ptr);
    g_pTestClass->m_mem_alloc_trace.add(ptr);
    return ptr;
}

void
os_free_internal(void* ptr)
{
    g_pTestClass->m_mem_alloc_trace.remove(ptr);
    free(ptr);
}

void*
os_calloc(const size_t nmemb, const size_t size)
{
    if (++g_pTestClass->m_malloc_cnt == g_pTestClass->m_malloc_fail_on_cnt)
    {
        return nullptr;
    }
    void* ptr = calloc(nmemb, size);
    assert(nullptr != ptr);
    g_pTestClass->m_mem_alloc_trace.add(ptr);
    return ptr;
}

bool
nrf52swd_init(void)
{
    return g_pTestClass->m_result_nrf52swd_init;
}

void
nrf52swd_deinit(void)
{
}

bool
nrf52swd_reset(const bool flag_reset)
{
    return true;
}

bool
nrf52swd_check_id_code(void)
{
    return g_pTestClass->m_result_nrf52swd_check_id_code;
}

bool
nrf52swd_debug_halt(void)
{
    return g_pTestClass->m_result_nrf52swd_debug_halt;
}

bool
nrf52swd_debug_enable_reset_vector_catch(void)
{
    return g_pTestClass->m_result_nrf52swd_debug_enable_reset_vector_catch;
}

bool
nrf52swd_debug_reset(void)
{
    return g_pTestClass->m_result_nrf52swd_debug_reset;
}

bool
nrf52swd_debug_run(void)
{
    return g_pTestClass->m_result_nrf52swd_debug_run;
}

bool
nrf52swd_erase_all(void)
{
    g_pTestClass->m_cnt_nrf52swd_erase_all += 1;
    g_pTestClass->m_uicr_fw_ver = 0xFFFFFFFFU;
    return g_pTestClass->m_result_nrf52swd_erase_all;
}

bool
nrf52swd_write_mem(const uint32_t addr, const uint32_t num_words, const uint32_t* p_buf)
{
    return g_pTestClass->write_mem(addr, num_words, p_buf);
}

bool
nrf52swd_read_mem(const uint32_t addr, const uint32_t num_words, uint32_t* p_buf)
{
    return g_pTestClass->read_mem(addr, num_words, p_buf);
}

esp_err_t
esp_vfs_fat_spiflash_mount(
    const char*                       base_path,
    const char*                       partition_label,
    const esp_vfs_fat_mount_config_t* mount_config,
    wl_handle_t*                      wl_handle)
{
    g_pTestClass->m_mount_info.base_path       = string(base_path);
    g_pTestClass->m_mount_info.partition_label = string(partition_label);
    g_pTestClass->m_mount_info.mount_config    = *mount_config;
    *wl_handle                                 = g_pTestClass->m_mount_info.wl_handle;
    if (ESP_OK == g_pTestClass->m_mount_info.mount_err)
    {
        g_pTestClass->m_mount_info.flag_mounted = true;
    }
    return g_pTestClass->m_mount_info.mount_err;
}

esp_err_t
esp_vfs_fat_spiflash_unmount(const char* base_path, wl_handle_t wl_handle)
{
    assert(g_pTestClass->m_mount_info.flag_mounted);
    assert(g_pTestClass->m_mount_info.wl_handle == wl_handle);
    g_pTestClass->m_mount_info.flag_mounted = false;
    return g_pTestClass->m_mount_info.unmount_err;
}

esp_err_t
esp_vfs_fat_rawflash_mount(
    const char*                       base_path,
    const char*                       partition_label,
    const esp_vfs_fat_mount_config_t* mount_config)
{
    g_pTestClass->m_mount_info.base_path       = string(base_path);
    g_pTestClass->m_mount_info.partition_label = string(partition_label);
    g_pTestClass->m_mount_info.mount_config    = *mount_config;
    if (ESP_OK == g_pTestClass->m_mount_info.mount_raw_err)
    {
        g_pTestClass->m_mount_info.flag_mounted = true;
    }
    return g_pTestClass->m_mount_info.mount_raw_err;
}
esp_err_t
esp_vfs_fat_rawflash_unmount(const char* base_path, const char* partition_label)
{
    (void)base_path;
    (void)partition_label;
    assert(g_pTestClass->m_mount_info.flag_mounted);
    g_pTestClass->m_mount_info.flag_mounted = false;
    return g_pTestClass->m_mount_info.unmount_raw_err;
}

void
vTaskDelay(const TickType_t xTicksToDelay)
{
}

void
adv_post_green_led_async_disable(void)
{
}

