ruuvi/ruuvi.gateway_esp.c/tests/test_nrf52fw/test_nrf52fw.cpp
} // extern "C"

#define TEST_CHECK_LOG_RECORD_NRF52(level_, msg_) ESP_LOG_WRAPPER_TEST_CHECK_LOG_RECORD("nRF52Fw", level_, msg_);

#define TEST_CHECK_LOG_RECORD_FFFS(level_, msg_) ESP_LOG_WRAPPER_TEST_CHECK_LOG_RECORD("FlashFatFS", level_, msg_);

/*** Unit-Tests
 * *******************************************************************************************************/

TEST_F(TestNRF52Fw, test_parse_version_digit_0) // NOLINT
{
    uint8_t val = 1;
    ASSERT_TRUE(nrf52fw_parse_version_digit("0", nullptr, &val));
    ASSERT_EQ(0, val);
}

TEST_F(TestNRF52Fw, test_parse_version_digit_1) // NOLINT
{
    uint8_t val = 0;
    ASSERT_TRUE(nrf52fw_parse_version_digit("1", nullptr, &val));
    ASSERT_EQ(1, val);
}

TEST_F(TestNRF52Fw, test_parse_version_digit_2) // NOLINT
{
    uint8_t val = 0;
    ASSERT_TRUE(nrf52fw_parse_version_digit("2", nullptr, &val));
    ASSERT_EQ(2, val);
}

TEST_F(TestNRF52Fw, test_parse_version_digit_255) // NOLINT
{
    uint8_t val = 0;
    ASSERT_TRUE(nrf52fw_parse_version_digit("255", nullptr, &val));
    ASSERT_EQ(255, val);
}

TEST_F(TestNRF52Fw, test_parse_version_digit_256) // NOLINT
{
    uint8_t val = 0;
    ASSERT_FALSE(nrf52fw_parse_version_digit("256", nullptr, &val));
    ASSERT_EQ(0, val);
}

TEST_F(TestNRF52Fw, test_parse_version_digit_minus_1) // NOLINT
{
    uint8_t val = 0;
    ASSERT_FALSE(nrf52fw_parse_version_digit("-1", nullptr, &val));
    ASSERT_EQ(0, val);
}

TEST_F(TestNRF52Fw, test_parse_version_digit_abc) // NOLINT
{
    uint8_t val = 0;
    ASSERT_FALSE(nrf52fw_parse_version_digit("abc", nullptr, &val));
    ASSERT_EQ(0, val);
}

TEST_F(TestNRF52Fw, test_parse_version_digit_1q) // NOLINT
{
    uint8_t val = 0;
    ASSERT_FALSE(nrf52fw_parse_version_digit("1q", nullptr, &val));
    ASSERT_EQ(0, val);
}

TEST_F(TestNRF52Fw, test_parse_version_digit_ext_123_dot) // NOLINT
{
    uint8_t     val         = 0;
    const char* version_str = "123.";
    const char* token_end   = strchr(version_str, '.');
    ASSERT_TRUE(nrf52fw_parse_version_digit(version_str, token_end, &val));
    ASSERT_EQ(123, val);
}

TEST_F(TestNRF52Fw, test_parse_version_digit_ext_12q_dot) // NOLINT
{
    uint8_t     val         = 0;
    const char* version_str = "12q.";
    const char* token_end   = strchr(version_str, '.');
    ASSERT_FALSE(nrf52fw_parse_version_digit(version_str, token_end, &val));
    ASSERT_EQ(0, val);
}

TEST_F(TestNRF52Fw, test_nrf52fw_parse_digit_update_ver_byte_num_0_ok) // NOLINT
{
    const char*   ver_str       = "qq12.";
    const char*   p_token_begin = &ver_str[2];
    const char*   p_token_end   = &ver_str[4];
    const uint8_t byte_num      = 0;
    uint32_t      version       = 0;
    ASSERT_TRUE(nrf52fw_parse_digit_update_ver(p_token_begin, p_token_end, &version, byte_num));
    ASSERT_EQ(0x0000000CU, version);
}

TEST_F(TestNRF52Fw, test_nrf52fw_parse_digit_update_ver_byte_num_1_ok) // NOLINT
{
    const char*   ver_str       = "qq13.";
    const char*   p_token_begin = &ver_str[2];
    const char*   p_token_end   = &ver_str[4];
    const uint8_t byte_num      = 1;
    uint32_t      version       = 0;
    ASSERT_TRUE(nrf52fw_parse_digit_update_ver(p_token_begin, p_token_end, &version, byte_num));
    ASSERT_EQ(0x00000D00U, version);
}

TEST_F(TestNRF52Fw, test_nrf52fw_parse_digit_update_ver_byte_num_2_ok) // NOLINT
{
    const char*   ver_str       = "qq255.";
    const char*   p_token_begin = &ver_str[2];
    const char*   p_token_end   = &ver_str[5];
    const uint8_t byte_num      = 2;
    uint32_t      version       = 0;
    ASSERT_TRUE(nrf52fw_parse_digit_update_ver(p_token_begin, p_token_end, &version, byte_num));
    ASSERT_EQ(0x00FF0000U, version);
}

TEST_F(TestNRF52Fw, test_nrf52fw_parse_digit_update_ver_byte_num_3_ok) // NOLINT
{
    const char*   ver_str       = "qq12.";
    const char*   p_token_begin = &ver_str[2];
    const char*   p_token_end   = &ver_str[4];
    const uint8_t byte_num      = 3;
    uint32_t      version       = 0;
    ASSERT_TRUE(nrf52fw_parse_digit_update_ver(p_token_begin, p_token_end, &version, byte_num));
    ASSERT_EQ(0x0C000000U, version);
}

TEST_F(TestNRF52Fw, test_nrf52fw_parse_digit_update_ver_byte_num_3_fail) // NOLINT
{
    const char*   ver_str       = "qq12.";
    const char*   p_token_begin = &ver_str[2];
    const char*   p_token_end   = &ver_str[5];
    const uint8_t byte_num      = 3;
    uint32_t      version       = 0;
    ASSERT_FALSE(nrf52fw_parse_digit_update_ver(p_token_begin, p_token_end, &version, byte_num));
    ASSERT_EQ(0U, version);
}

TEST_F(TestNRF52Fw, test_parse_version_ok_1_2_3) // NOLINT
{
    ruuvi_nrf52_fw_ver_t fw_ver = { 0 };
    ASSERT_TRUE(nrf52fw_parse_version("1.2.3", &fw_ver));
    ASSERT_EQ(0x01020300, fw_ver.version);
}

TEST_F(TestNRF52Fw, test_parse_version_ok_1_2_3_with_null_output) // NOLINT
{
    ASSERT_TRUE(nrf52fw_parse_version("1.2.3", nullptr));
}

TEST_F(TestNRF52Fw, test_parse_version_fail_1_2_) // NOLINT
{
    ruuvi_nrf52_fw_ver_t fw_ver = { 0 };
    ASSERT_FALSE(nrf52fw_parse_version("1.2.", &fw_ver));
    ASSERT_EQ(0, fw_ver.version);
}

TEST_F(TestNRF52Fw, test_parse_version_fail_1_2) // NOLINT
{
    ruuvi_nrf52_fw_ver_t fw_ver = { 0 };
    ASSERT_FALSE(nrf52fw_parse_version("1.2", &fw_ver));
    ASSERT_EQ(0, fw_ver.version);
}

TEST_F(TestNRF52Fw, test_parse_version_fail_1_) // NOLINT
{
    ruuvi_nrf52_fw_ver_t fw_ver = { 0 };
    ASSERT_FALSE(nrf52fw_parse_version("1.", &fw_ver));
    ASSERT_EQ(0, fw_ver.version);
}

TEST_F(TestNRF52Fw, test_parse_version_fail_1) // NOLINT
{
    ruuvi_nrf52_fw_ver_t fw_ver = { 0 };
    ASSERT_FALSE(nrf52fw_parse_version("1", &fw_ver));
    ASSERT_EQ(0, fw_ver.version);
}

TEST_F(TestNRF52Fw, test_parse_version_fail_1x_2_3) // NOLINT
{
    ruuvi_nrf52_fw_ver_t fw_ver = { 0 };
    ASSERT_FALSE(nrf52fw_parse_version("1x.2.3", &fw_ver));
    ASSERT_EQ(0, fw_ver.version);
}

TEST_F(TestNRF52Fw, test_parse_version_fail_1_2x_3) // NOLINT
{
    ruuvi_nrf52_fw_ver_t fw_ver = { 0 };
    ASSERT_FALSE(nrf52fw_parse_version("1.2x.3", &fw_ver));
    ASSERT_EQ(0, fw_ver.version);
}

