ruuvi/ruuvi.gateway_esp.c/tests/test_nrf52fw/test_nrf52fw.cpp
TEST_F(TestNRF52Fw, test_parse_version_fail_1_2_3x) // NOLINT
{
    ruuvi_nrf52_fw_ver_t fw_ver = { 0 };
    ASSERT_FALSE(nrf52fw_parse_version("1.2.3x", &fw_ver));
    ASSERT_EQ(0, fw_ver.version);
}

TEST_F(TestNRF52Fw, test_parse_version_fail_empty) // NOLINT
{
    ruuvi_nrf52_fw_ver_t fw_ver = { 0 };
    ASSERT_FALSE(nrf52fw_parse_version("", &fw_ver));
    ASSERT_EQ(0, fw_ver.version);
}

TEST_F(TestNRF52Fw, test_parse_version_fail_null) // NOLINT
{
    ruuvi_nrf52_fw_ver_t fw_ver = { 0 };
    ASSERT_FALSE(nrf52fw_parse_version(nullptr, &fw_ver));
    ASSERT_EQ(0, fw_ver.version);
}

TEST_F(TestNRF52Fw, test_parse_version_line_ok_1_2_3) // NOLINT
{
    ruuvi_nrf52_fw_ver_t fw_ver = { 0 };
    ASSERT_TRUE(nrf52fw_parse_version_line("# v1.2.3", &fw_ver));
    ASSERT_EQ(0x01020300, fw_ver.version);
}

TEST_F(TestNRF52Fw, test_parse_version_line_fail_1) // NOLINT
{
    ruuvi_nrf52_fw_ver_t fw_ver = { 0 };
    ASSERT_FALSE(nrf52fw_parse_version_line("# 1.2.3", &fw_ver));
    ASSERT_EQ(0x00000000, fw_ver.version);
}

TEST_F(TestNRF52Fw, test_parse_version_line_fail_2) // NOLINT
{
    ruuvi_nrf52_fw_ver_t fw_ver = { 0 };
    ASSERT_FALSE(nrf52fw_parse_version_line("v1.2.3", &fw_ver));
    ASSERT_EQ(0x00000000, fw_ver.version);
}

TEST_F(TestNRF52Fw, test_nrf52fw_line_rstrip_empty) // NOLINT
{
    char buf[40];
    //    snprintf(buf, sizeof(buf), "");
    buf[0] = '\0';
    nrf52fw_line_rstrip(buf, sizeof(buf));
    ASSERT_EQ(string(""), string(buf));
}

TEST_F(TestNRF52Fw, test_nrf52fw_line_rstrip_abc) // NOLINT
{
    char buf[40];
    snprintf(buf, sizeof(buf), "abc");
    nrf52fw_line_rstrip(buf, sizeof(buf));
    ASSERT_EQ(string("abc"), string(buf));
}

TEST_F(TestNRF52Fw, test_nrf52fw_line_rstrip_abc_cr) // NOLINT
{
    char buf[40];
    snprintf(buf, sizeof(buf), "abc\r");
    nrf52fw_line_rstrip(buf, sizeof(buf));
    ASSERT_EQ(string("abc"), string(buf));
}

TEST_F(TestNRF52Fw, test_nrf52fw_line_rstrip_abc_lf) // NOLINT
{
    char buf[40];
    snprintf(buf, sizeof(buf), "abc\n");
    nrf52fw_line_rstrip(buf, sizeof(buf));
    ASSERT_EQ(string("abc"), string(buf));
}

TEST_F(TestNRF52Fw, test_nrf52fw_line_rstrip_abc_cr_lf) // NOLINT
{
    char buf[40];
    snprintf(buf, sizeof(buf), "abc\r\n");
    nrf52fw_line_rstrip(buf, sizeof(buf));
    ASSERT_EQ(string("abc"), string(buf));
}

TEST_F(TestNRF52Fw, test_nrf52fw_line_rstrip_abc_space_tab_cr_lf) // NOLINT
{
    char buf[40];
    snprintf(buf, sizeof(buf), "abc \t \r\n");
    nrf52fw_line_rstrip(buf, sizeof(buf));
    ASSERT_EQ(string("abc"), string(buf));
}

TEST_F(TestNRF52Fw, test_nrf52fw_parse_segment_info_line_empty) // NOLINT
{
    nrf52fw_segment_t segment = { 0 };
    ASSERT_FALSE(nrf52fw_parse_segment_info_line("", &segment));
}

TEST_F(TestNRF52Fw, test_nrf52fw_parse_segment_info_line_ok) // NOLINT
{
    nrf52fw_segment_t segment = { 0 };
    ASSERT_TRUE(nrf52fw_parse_segment_info_line("0x00001000 151016 segment_2.bin 0x0e326e66", &segment));
    ASSERT_EQ(0x00001000, segment.address);
    ASSERT_EQ(151016, segment.size);
    ASSERT_EQ(0x0e326e66, segment.crc);
    ASSERT_EQ(string("segment_2.bin"), string(segment.file_name));
}

TEST_F(TestNRF52Fw, test_nrf52fw_parse_segment_info_line_ok_alt1) // NOLINT
{
    nrf52fw_segment_t segment = { 0 };
    ASSERT_TRUE(nrf52fw_parse_segment_info_line("00001000 \t 0x24DE8 \t segment_2.bin \t 0e326e66", &segment));
    ASSERT_EQ(0x00001000, segment.address);
    ASSERT_EQ(151016, segment.size);
    ASSERT_EQ(0x0e326e66, segment.crc);
    ASSERT_EQ(string("segment_2.bin"), string(segment.file_name));
}

TEST_F(TestNRF52Fw, test_nrf52fw_parse_segment_info_line_ok_alt2) // NOLINT
{
    nrf52fw_segment_t segment = { 0 };
    ASSERT_TRUE(nrf52fw_parse_segment_info_line("00001000\t 0x24DE8\t segment_2.bin\t 0e326e66", &segment));
    ASSERT_EQ(0x00001000, segment.address);
    ASSERT_EQ(151016, segment.size);
    ASSERT_EQ(0x0e326e66, segment.crc);
    ASSERT_EQ(string("segment_2.bin"), string(segment.file_name));
}

TEST_F(TestNRF52Fw, test_nrf52fw_parse_segment_info_line_fail_1) // NOLINT
{
    nrf52fw_segment_t segment = { 0 };
    ASSERT_FALSE(nrf52fw_parse_segment_info_line("0x00001000 151016 segment_2.bin 0x0e326e6q", &segment));
}

TEST_F(TestNRF52Fw, test_nrf52fw_parse_segment_info_line_fail_2) // NOLINT
{
    nrf52fw_segment_t segment = { 0 };
    ASSERT_FALSE(nrf52fw_parse_segment_info_line("0x00001000 151016 segment_2.bin ", &segment));
}

TEST_F(TestNRF52Fw, test_nrf52fw_parse_segment_info_line_fail_3) // NOLINT
{
    nrf52fw_segment_t segment = { 0 };
    ASSERT_FALSE(nrf52fw_parse_segment_info_line("0x00001000 151016 segment_2.bin", &segment));
}

TEST_F(TestNRF52Fw, test_nrf52fw_parse_segment_info_line_fail_4) // NOLINT
{
    nrf52fw_segment_t segment = { 0 };
    ASSERT_FALSE(nrf52fw_parse_segment_info_line("0x00001000 151016 0x0e326e6", &segment));
}

TEST_F(TestNRF52Fw, test_nrf52fw_parse_segment_info_line_fail_5) // NOLINT
{
    nrf52fw_segment_t segment = { 0 };
    ASSERT_FALSE(nrf52fw_parse_segment_info_line("0x00001000 151016q segment_2.bin 0x0e326e6", &segment));
}

TEST_F(TestNRF52Fw, test_nrf52fw_parse_segment_info_line_fail_6) // NOLINT
{
    nrf52fw_segment_t segment = { 0 };
    ASSERT_FALSE(nrf52fw_parse_segment_info_line("0x00001000q 151016 segment_2.bin 0x0e326e6", &segment));
}

TEST_F(TestNRF52Fw, test_nrf52fw_parse_info_file_1) // NOLINT
{
    const char* p_path_info_txt = "info.txt";
    {
        this->m_fd = this->open_file(p_path_info_txt, "w");
        ASSERT_NE(nullptr, this->m_fd);
        fputs("# v1.4.2\n", this->m_fd);
        fputs("0x00000000 2816 segment_1.bin 0xc9924e37\n", this->m_fd);
        fputs("0x00001000 151016 segment_2.bin 0x0e326e66\n", this->m_fd);
        fputs("0x00026000 24448 segment_3.bin 0x9c7cffe7\n", this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }
    {
        this->m_fd = this->open_file(p_path_info_txt, "r");
        ASSERT_NE(nullptr, this->m_fd);

        nrf52fw_info_t info = { 0 };
        ASSERT_EQ(0, nrf52fw_parse_info_file(this->m_fd, &info));
        ASSERT_EQ(0x01040200, info.fw_ver.version);
        ASSERT_EQ(3, info.num_segments);

        {
            const nrf52fw_segment_t* p_segment = &info.segments[0];
            ASSERT_EQ(0x00000000, p_segment->address);
            ASSERT_EQ(2816, p_segment->size);
            ASSERT_EQ(string("segment_1.bin"), string(p_segment->file_name));
            ASSERT_EQ(0xc9924e37, p_segment->crc);
        }
        {
            const nrf52fw_segment_t* p_segment = &info.segments[1];
            ASSERT_EQ(0x00001000, p_segment->address);
            ASSERT_EQ(151016, p_segment->size);
            ASSERT_EQ(string("segment_2.bin"), string(p_segment->file_name));
            ASSERT_EQ(0x0e326e66, p_segment->crc);
        }
        {
            const nrf52fw_segment_t* p_segment = &info.segments[2];
            ASSERT_EQ(0x00026000, p_segment->address);
            ASSERT_EQ(24448, p_segment->size);
            ASSERT_EQ(string("segment_3.bin"), string(p_segment->file_name));
            ASSERT_EQ(0x9c7cffe7, p_segment->crc);
        }

        fclose(this->m_fd);
        this->m_fd = nullptr;
    }
}

