ruuvi/ruuvi.gateway_esp.c/tests/test_nrf52fw/test_nrf52fw.cpp
TEST_F(TestNRF52Fw, test_nrf52fw_parse_info_file_no_version) // NOLINT
{
    const char* p_path_info_txt = "info.txt";
    {
        this->m_fd = this->open_file(p_path_info_txt, "w");
        ASSERT_NE(nullptr, this->m_fd);
        fputs("0x00000000 2816 segment_1.bin 0xc9924e37\n", this->m_fd);
        fputs("0x00001000 151016 segment_2.bin 0x0e326e66\n", this->m_fd);
        fputs("0x00026000 24448 segment_3.bin 0x9c7cffe7\n", this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }
    {
        this->m_fd = this->open_file(p_path_info_txt, "r");
        ASSERT_NE(nullptr, this->m_fd);

        nrf52fw_info_t info = { 0 };
        ASSERT_EQ(1, nrf52fw_parse_info_file(this->m_fd, &info));
        ASSERT_EQ(0, info.fw_ver.version);
        ASSERT_EQ(0, info.num_segments);

        fclose(this->m_fd);
        this->m_fd = nullptr;
    }
}

TEST_F(TestNRF52Fw, test_nrf52fw_parse_info_file_bad_line_2) // NOLINT
{
    const char* p_path_info_txt = "info.txt";
    {
        this->m_fd = this->open_file(p_path_info_txt, "w");
        ASSERT_NE(nullptr, this->m_fd);
        fputs("# v1.4.2\n", this->m_fd);
        fputs("0x00000000 2816zzzz segment_1.bin 0xc9924e37\n", this->m_fd);
        fputs("0x00001000 151016 segment_2.bin 0x0e326e66\n", this->m_fd);
        fputs("0x00026000 24448 segment_3.bin 0x9c7cffe7\n", this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }
    {
        this->m_fd = this->open_file(p_path_info_txt, "r");
        ASSERT_NE(nullptr, this->m_fd);

        nrf52fw_info_t info = { 0 };
        ASSERT_EQ(2, nrf52fw_parse_info_file(this->m_fd, &info));
        ASSERT_EQ(0x01040200, info.fw_ver.version);
        ASSERT_EQ(0, info.num_segments);

        fclose(this->m_fd);
        this->m_fd = nullptr;
    }
}

TEST_F(TestNRF52Fw, test_nrf52fw_parse_info_file_segments_overflow) // NOLINT
{
    const char* p_path_info_txt = "info.txt";
    {
        this->m_fd = this->open_file(p_path_info_txt, "w");
        ASSERT_NE(nullptr, this->m_fd);
        fputs("# v1.4.2\n", this->m_fd);
        fputs("0x00000000 2816 segment_1.bin 0xc9924e37\n", this->m_fd);
        fputs("0x00001000 151016 segment_2.bin 0x0e326e66\n", this->m_fd);
        fputs("0x00026000 24448 segment_3.bin 0x9c7cffe7\n", this->m_fd);
        fputs("0x00027000 24448 segment_4.bin 0x9c7cffe7\n", this->m_fd);
        fputs("0x00028000 24448 segment_5.bin 0x9c7cffe7\n", this->m_fd);
        fputs("0x00029000 24448 segment_6.bin 0x9c7cffe7\n", this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }
    {
        this->m_fd = this->open_file(p_path_info_txt, "r");
        ASSERT_NE(nullptr, this->m_fd);

        nrf52fw_info_t info = { 0 };
        ASSERT_EQ(7, nrf52fw_parse_info_file(this->m_fd, &info));
        ASSERT_EQ(0x01040200, info.fw_ver.version);
        ASSERT_EQ(5, info.num_segments);

        fclose(this->m_fd);
        this->m_fd = nullptr;
    }
}

TEST_F(TestNRF52Fw, nrf52fw_read_info_txt) // NOLINT
{
    {
        this->m_fd = open_file(this->m_info_txt_name, "w");
        ASSERT_NE(nullptr, this->m_fd);
        fputs("# v1.4.2\n", this->m_fd);
        fputs("0x00000000 2816 segment_1.bin 0xc9924e37\n", this->m_fd);
        fputs("0x00001000 151016 segment_2.bin 0x0e326e66\n", this->m_fd);
        fputs("0x00026000 24448 segment_3.bin 0x9c7cffe7\n", this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }
    {
        this->m_p_ffs = flashfatfs_mount(this->m_mount_point, GW_NRF_PARTITION, 2, false);
        ASSERT_NE(nullptr, this->m_p_ffs);

        nrf52fw_info_t info = { 0 };
        ASSERT_TRUE(nrf52fw_read_info_txt(this->m_p_ffs, this->m_info_txt_name, &info));

        ASSERT_EQ(0x01040200, info.fw_ver.version);
        ASSERT_EQ(3, info.num_segments);

        {
            const nrf52fw_segment_t* p_segment = &info.segments[0];
            ASSERT_EQ(0x00000000, p_segment->address);
            ASSERT_EQ(2816, p_segment->size);
            ASSERT_EQ(string("segment_1.bin"), string(p_segment->file_name));
            ASSERT_EQ(0xc9924e37, p_segment->crc);
        }
        {
            const nrf52fw_segment_t* p_segment = &info.segments[1];
            ASSERT_EQ(0x00001000, p_segment->address);
            ASSERT_EQ(151016, p_segment->size);
            ASSERT_EQ(string("segment_2.bin"), string(p_segment->file_name));
            ASSERT_EQ(0x0e326e66, p_segment->crc);
        }
        {
            const nrf52fw_segment_t* p_segment = &info.segments[2];
            ASSERT_EQ(0x00026000, p_segment->address);
            ASSERT_EQ(24448, p_segment->size);
            ASSERT_EQ(string("segment_3.bin"), string(p_segment->file_name));
            ASSERT_EQ(0x9c7cffe7, p_segment->crc);
        }
        ASSERT_TRUE(flashfatfs_unmount(&this->m_p_ffs));
        this->m_p_ffs = nullptr;
    }
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}

TEST_F(TestNRF52Fw, nrf52fw_read_info_txt_no_file) // NOLINT
{
    nrf52fw_info_t info = { 0 };

    this->m_p_ffs = flashfatfs_mount(this->m_mount_point, GW_NRF_PARTITION, 2, false);
    ASSERT_NE(nullptr, this->m_p_ffs);

    ASSERT_FALSE(nrf52fw_read_info_txt(this->m_p_ffs, this->m_info_txt_name, &info));

    ASSERT_TRUE(flashfatfs_unmount(&this->m_p_ffs));
    this->m_p_ffs = nullptr;

    ASSERT_EQ(0, info.fw_ver.version);
    ASSERT_EQ(0, info.num_segments);

    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_INFO, "Mount partition 'fatfs_nrf52' to the mount point /fs_nrf52");
    TEST_CHECK_LOG_RECORD_FFFS(
        ESP_LOG_INFO,
        "Mount partition 'fatfs_nrf52' as FATFS (SPI-Flash) to the mount point /fs_nrf52");
    TEST_CHECK_LOG_RECORD_FFFS(
        ESP_LOG_INFO,
        "Partition 'fatfs_nrf52' mounted successfully to /fs_nrf52 as FATFS on SPI-Flash");
    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_ERROR, "Can't open: ./fs_nrf52/info.txt");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_ERROR, "Can't open: info.txt");
    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_INFO, "Unmount ./fs_nrf52");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}

TEST_F(TestNRF52Fw, nrf52fw_read_info_txt_bad_line_3) // NOLINT
{
    {
        this->m_fd = open_file(this->m_info_txt_name, "w");
        ASSERT_NE(nullptr, this->m_fd);
        fputs("# v1.4.2\n", this->m_fd);
        fputs("0x00000000 2816 segment_1.bin 0xc9924e37\n", this->m_fd);
        fputs("0x00001000q 151016 segment_2.bin 0x0e326e66\n", this->m_fd);
        fputs("0x00026000 24448 segment_3.bin 0x9c7cffe7\n", this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }
    this->m_p_ffs = flashfatfs_mount(this->m_mount_point, GW_NRF_PARTITION, 2, false);
    ASSERT_NE(nullptr, this->m_p_ffs);
    {
        nrf52fw_info_t info = { 0 };
        ASSERT_FALSE(nrf52fw_read_info_txt(this->m_p_ffs, this->m_info_txt_name, &info));

