ruuvi/ruuvi.gateway_esp.c/tests/test_nrf52fw/test_nrf52fw.cpp
        ASSERT_EQ(0x01040200, info.fw_ver.version);
        ASSERT_EQ(1, info.num_segments);
    }
    ASSERT_TRUE(flashfatfs_unmount(&this->m_p_ffs));
    this->m_p_ffs = nullptr;
    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_INFO, "Mount partition 'fatfs_nrf52' to the mount point /fs_nrf52");
    TEST_CHECK_LOG_RECORD_FFFS(
        ESP_LOG_INFO,
        "Mount partition 'fatfs_nrf52' as FATFS (SPI-Flash) to the mount point /fs_nrf52");
    TEST_CHECK_LOG_RECORD_FFFS(
        ESP_LOG_INFO,
        "Partition 'fatfs_nrf52' mounted successfully to /fs_nrf52 as FATFS on SPI-Flash");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_ERROR, "Failed to parse 'info.txt' at line 3");
    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_INFO, "Unmount ./fs_nrf52");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}

TEST_F(TestNRF52Fw, nrf52fw_read_current_fw_version_ok) // NOLINT
{
    const uint32_t version = 0x01020300;
    this->m_uicr_fw_ver    = version;

    ruuvi_nrf52_fw_ver_t fw_ver = { 0 };
    ASSERT_TRUE(nrf52fw_read_current_fw_ver(&fw_ver));
    ASSERT_EQ(version, fw_ver.version);
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}

TEST_F(TestNRF52Fw, nrf52fw_write_current_fw_version_ok) // NOLINT
{
    const uint32_t version = 0x01020300;

    ASSERT_TRUE(nrf52fw_write_current_fw_ver(version));
    {
        ASSERT_EQ(version, this->m_uicr_fw_ver); // UICR
    }
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}

TEST_F(TestNRF52Fw, nrf52fw_write_current_fw_version_fail) // NOLINT
{
    ASSERT_TRUE(nrf52fw_write_current_fw_ver(0x01020300));
    ASSERT_FALSE(nrf52fw_write_current_fw_ver(0x02030400));
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}

TEST_F(TestNRF52Fw, nrf52fw_flash_write_segment_ok_16_words) // NOLINT
{
    const char* segment_path = "segment_1.bin";
    uint32_t    segment_buf[16];
    for (int i = 0; i < sizeof(segment_buf) / sizeof(segment_buf[0]); ++i)
    {
        segment_buf[i] = 0xAA000000 + i;
    }

    {
        this->m_fd = this->open_file(segment_path, "wb");
        ASSERT_NE(nullptr, this->m_fd);
        fwrite(segment_buf, sizeof(segment_buf[0]), sizeof(segment_buf) / sizeof(segment_buf[0]), this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }

    this->m_fd = this->open_file(segment_path, "rb");
    ASSERT_NE(nullptr, this->m_fd);

    nrf52fw_tmp_buf_t tmp_buf = { 0 };

    const uint32_t segment_addr = 0x00001000;
    this->m_memSegmentsRead.emplace_back(
        MemSegment(segment_addr, sizeof(segment_buf) / sizeof(segment_buf[0]), segment_buf));

    ASSERT_TRUE(nrf52fw_flash_write_segment(fileno(this->m_fd), &tmp_buf, segment_addr, sizeof(segment_buf), nullptr));
    ASSERT_EQ(1, this->m_memSegmentsWrite.size());
    {
        ASSERT_EQ(this->m_memSegmentsRead[0].segmentAddr, this->m_memSegmentsWrite[0].segmentAddr);
        ASSERT_EQ(this->m_memSegmentsRead[0].data, this->m_memSegmentsWrite[0].data);
    }
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001000...");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}

TEST_F(TestNRF52Fw, nrf52fw_flash_write_segment_ok_257_words) // NOLINT
{
    const char* segment_path = "segment_1.bin";
    uint32_t    segment_buf[257];
    for (int i = 0; i < sizeof(segment_buf) / sizeof(segment_buf[0]); ++i)
    {
        segment_buf[i] = 0xAA000000 + i;
    }

    {
        this->m_fd = this->open_file(segment_path, "wb");
        ASSERT_NE(nullptr, this->m_fd);
        fwrite(segment_buf, sizeof(segment_buf[0]), sizeof(segment_buf) / sizeof(segment_buf[0]), this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }

    this->m_fd = this->open_file(segment_path, "rb");
    ASSERT_NE(nullptr, this->m_fd);

    nrf52fw_tmp_buf_t tmp_buf = { 0 };

    const uint32_t segment_addr = 0x00001000;
    this->m_memSegmentsRead.emplace_back(
        MemSegment(segment_addr, sizeof(segment_buf) / sizeof(segment_buf[0]), segment_buf));

    ASSERT_TRUE(nrf52fw_flash_write_segment(fileno(this->m_fd), &tmp_buf, segment_addr, sizeof(segment_buf), nullptr));
    ASSERT_EQ(1, this->m_memSegmentsWrite.size());
    {
        ASSERT_EQ(this->m_memSegmentsRead[0].segmentAddr, this->m_memSegmentsWrite[0].segmentAddr);
        ASSERT_EQ(this->m_memSegmentsRead[0].data, this->m_memSegmentsWrite[0].data);
    }
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001000...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001100...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001200...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001300...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001400...");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Fw, nrf52fw_flash_write_segment_ok_513_words_with_progress_info) // NOLINT
{
    const char*    segment_path    = "segment_1.bin";
    const uint32_t num_words_total = 513;
    uint32_t       segment_buf[num_words_total];
    for (int i = 0; i < sizeof(segment_buf) / sizeof(segment_buf[0]); ++i)
    {
        segment_buf[i] = 0xAA000000 + i;
    }

    {
        this->m_fd = this->open_file(segment_path, "wb");
        ASSERT_NE(nullptr, this->m_fd);
        fwrite(segment_buf, sizeof(segment_buf[0]), sizeof(segment_buf) / sizeof(segment_buf[0]), this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }

    this->m_fd = this->open_file(segment_path, "rb");
    ASSERT_NE(nullptr, this->m_fd);

    nrf52fw_tmp_buf_t tmp_buf = { 0 };

    const uint32_t segment_addr = 0x00001000;
    this->m_memSegmentsRead.emplace_back(
        MemSegment(segment_addr, sizeof(segment_buf) / sizeof(segment_buf[0]), segment_buf));

    nrf52fw_progress_info_t progress_info = {
        .accum_num_bytes_flashed = 0,
        .total_size              = num_words_total * sizeof(uint32_t),
        .cb_progress             = nullptr,
        .p_param_cb_progress     = nullptr,
    };

