ruuvi/ruuvi.gateway_esp.c/tests/test_nrf52fw/test_nrf52fw.cpp
    ASSERT_TRUE(
        nrf52fw_flash_write_segment(fileno(this->m_fd), &tmp_buf, segment_addr, sizeof(segment_buf), &progress_info));
    ASSERT_EQ(1, this->m_memSegmentsWrite.size());
    {
        ASSERT_EQ(this->m_memSegmentsRead[0].segmentAddr, this->m_memSegmentsWrite[0].segmentAddr);
        ASSERT_EQ(this->m_memSegmentsRead[0].data, this->m_memSegmentsWrite[0].data);
    }
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001000...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001100...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001200...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001300...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001400...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001500...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001600...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001700...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001800...");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
    ASSERT_EQ(num_words_total * sizeof(uint32_t), progress_info.accum_num_bytes_flashed);
    ASSERT_EQ(num_words_total * sizeof(uint32_t), progress_info.total_size);
}

static void
cb_progress(const size_t num_bytes_flashed, const size_t total_size, void* const p_param)
{
    if (nullptr != p_param)
    {
        auto p_cnt = static_cast<uint32_t* const>(p_param);
        *p_cnt += 1;
    }
    const ProgressInfo progress_info = {
        .num_bytes_flashed = num_bytes_flashed,
        .total_size        = total_size,
        .p_param           = p_param,
    };
    g_pTestClass->m_progress.emplace_back(progress_info);
}

TEST_F(TestNRF52Fw, nrf52fw_flash_write_segment_ok_513_words_with_progress_info_and_callback) // NOLINT
{
    const char*    segment_path    = "segment_1.bin";
    const uint32_t num_words_total = 513;
    uint32_t       segment_buf[num_words_total];
    for (int i = 0; i < sizeof(segment_buf) / sizeof(segment_buf[0]); ++i)
    {
        segment_buf[i] = 0xAA000000 + i;
    }

    {
        this->m_fd = this->open_file(segment_path, "wb");
        ASSERT_NE(nullptr, this->m_fd);
        fwrite(segment_buf, sizeof(segment_buf[0]), sizeof(segment_buf) / sizeof(segment_buf[0]), this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }

    this->m_fd = this->open_file(segment_path, "rb");
    ASSERT_NE(nullptr, this->m_fd);

    nrf52fw_tmp_buf_t tmp_buf = { 0 };

    const uint32_t segment_addr = 0x00001000;
    this->m_memSegmentsRead.emplace_back(
        MemSegment(segment_addr, sizeof(segment_buf) / sizeof(segment_buf[0]), segment_buf));

    uint32_t                cb_progress_cnt = 0;
    nrf52fw_progress_info_t progress_info   = {
          .accum_num_bytes_flashed = 0,
          .total_size              = num_words_total * sizeof(uint32_t),
          .cb_progress             = &cb_progress,
          .p_param_cb_progress     = &cb_progress_cnt,
    };

    ASSERT_TRUE(
        nrf52fw_flash_write_segment(fileno(this->m_fd), &tmp_buf, segment_addr, sizeof(segment_buf), &progress_info));
    ASSERT_EQ(1, this->m_memSegmentsWrite.size());
    {
        ASSERT_EQ(this->m_memSegmentsRead[0].segmentAddr, this->m_memSegmentsWrite[0].segmentAddr);
        ASSERT_EQ(this->m_memSegmentsRead[0].data, this->m_memSegmentsWrite[0].data);
    }
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001000...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001100...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001200...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001300...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001400...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001500...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001600...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001700...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001800...");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    ASSERT_EQ(9, cb_progress_cnt);
    ASSERT_EQ(num_words_total * sizeof(uint32_t), progress_info.accum_num_bytes_flashed);
    ASSERT_EQ(num_words_total * sizeof(uint32_t), progress_info.total_size);

    auto progress_iter = this->m_progress.begin();
    ASSERT_NE(this->m_progress.end(), progress_iter);
    {
        ASSERT_EQ(progress_iter->total_size, progress_info.total_size);
        ASSERT_EQ(progress_iter->p_param, progress_info.p_param_cb_progress);
        ASSERT_EQ(progress_iter->num_bytes_flashed, 256 * 1);
    }
    progress_iter++;
    ASSERT_NE(this->m_progress.end(), progress_iter);
    {
        ASSERT_EQ(progress_iter->total_size, progress_info.total_size);
        ASSERT_EQ(progress_iter->p_param, progress_info.p_param_cb_progress);
        ASSERT_EQ(progress_iter->num_bytes_flashed, 256 * 2);
    }
    progress_iter++;
    ASSERT_NE(this->m_progress.end(), progress_iter);
    {
        ASSERT_EQ(progress_iter->total_size, progress_info.total_size);
        ASSERT_EQ(progress_iter->p_param, progress_info.p_param_cb_progress);
        ASSERT_EQ(progress_iter->num_bytes_flashed, 256 * 3);
    }
    progress_iter++;
    ASSERT_NE(this->m_progress.end(), progress_iter);
    {
        ASSERT_EQ(progress_iter->total_size, progress_info.total_size);
        ASSERT_EQ(progress_iter->p_param, progress_info.p_param_cb_progress);
        ASSERT_EQ(progress_iter->num_bytes_flashed, 256 * 4);
    }
    progress_iter++;
    ASSERT_NE(this->m_progress.end(), progress_iter);
    {
        ASSERT_EQ(progress_iter->total_size, progress_info.total_size);
        ASSERT_EQ(progress_iter->p_param, progress_info.p_param_cb_progress);
        ASSERT_EQ(progress_iter->num_bytes_flashed, 256 * 5);
    }
    progress_iter++;
    ASSERT_NE(this->m_progress.end(), progress_iter);
    {
        ASSERT_EQ(progress_iter->total_size, progress_info.total_size);
        ASSERT_EQ(progress_iter->p_param, progress_info.p_param_cb_progress);
        ASSERT_EQ(progress_iter->num_bytes_flashed, 256 * 6);
    }
    progress_iter++;
    ASSERT_NE(this->m_progress.end(), progress_iter);
    {
        ASSERT_EQ(progress_iter->total_size, progress_info.total_size);
        ASSERT_EQ(progress_iter->p_param, progress_info.p_param_cb_progress);
        ASSERT_EQ(progress_iter->num_bytes_flashed, 256 * 7);
    }
    progress_iter++;
    ASSERT_NE(this->m_progress.end(), progress_iter);
    {
        ASSERT_EQ(progress_iter->total_size, progress_info.total_size);
        ASSERT_EQ(progress_iter->p_param, progress_info.p_param_cb_progress);
        ASSERT_EQ(progress_iter->num_bytes_flashed, 256 * 8);
    }
    progress_iter++;
    ASSERT_NE(this->m_progress.end(), progress_iter);
    {
        ASSERT_EQ(progress_iter->total_size, progress_info.total_size);
        ASSERT_EQ(progress_iter->p_param, progress_info.p_param_cb_progress);
        ASSERT_EQ(progress_iter->num_bytes_flashed, num_words_total * sizeof(uint32_t));
    }
    progress_iter++;
    ASSERT_EQ(this->m_progress.end(), progress_iter);
}

