ruuvi/ruuvi.gateway_esp.c/tests/test_nrf52fw/test_nrf52fw.cpp
    nrf52fw_tmp_buf_t tmp_buf = { 0 };

    const uint32_t segment_addr = 0x00001000;
    this->m_memSegmentsRead.emplace_back(
        MemSegment(segment_addr, sizeof(segment_buf) / sizeof(segment_buf[0]), segment_buf));

    nrf52fw_simulate_file_read_error(true);
    ASSERT_FALSE(nrf52fw_flash_write_segment(fileno(this->m_fd), &tmp_buf, segment_addr, sizeof(segment_buf), nullptr));
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_ERROR, "nrf52fw_file_read failed");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}

TEST_F(TestNRF52Fw, nrf52fw_flash_write_segment_from_file_ok) // NOLINT
{
    const char* segment_path = "segment_1.bin";
    uint32_t    segment_buf[16];
    for (int i = 0; i < sizeof(segment_buf) / sizeof(segment_buf[0]); ++i)
    {
        segment_buf[i] = 0xAA000000 + i;
    }

    {
        this->m_fd = open_file(segment_path, "wb");
        ASSERT_NE(nullptr, this->m_fd);
        fwrite(segment_buf, sizeof(segment_buf[0]), sizeof(segment_buf) / sizeof(segment_buf[0]), this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }

    nrf52fw_tmp_buf_t tmp_buf = { 0 };

    const uint32_t segment_addr = 0x00001000;
    this->m_memSegmentsRead.emplace_back(
        MemSegment(segment_addr, sizeof(segment_buf) / sizeof(segment_buf[0]), segment_buf));

    this->m_p_ffs = flashfatfs_mount(this->m_mount_point, GW_NRF_PARTITION, 2, false);
    ASSERT_NE(nullptr, this->m_p_ffs);

    ASSERT_TRUE(nrf52fw_write_segment_from_file(
        this->m_p_ffs,
        segment_path,
        &tmp_buf,
        segment_addr,
        sizeof(segment_buf),
        nullptr));

    flashfatfs_unmount(&this->m_p_ffs);
    this->m_p_ffs = nullptr;

    ASSERT_EQ(1, this->m_memSegmentsWrite.size());
    {
        ASSERT_EQ(this->m_memSegmentsRead[0].segmentAddr, this->m_memSegmentsWrite[0].segmentAddr);
        ASSERT_EQ(this->m_memSegmentsRead[0].data, this->m_memSegmentsWrite[0].data);
    }
    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_INFO, "Mount partition 'fatfs_nrf52' to the mount point /fs_nrf52");
    TEST_CHECK_LOG_RECORD_FFFS(
        ESP_LOG_INFO,
        "Mount partition 'fatfs_nrf52' as FATFS (SPI-Flash) to the mount point /fs_nrf52");
    TEST_CHECK_LOG_RECORD_FFFS(
        ESP_LOG_INFO,
        "Partition 'fatfs_nrf52' mounted successfully to /fs_nrf52 as FATFS on SPI-Flash");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001000...");
    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_INFO, "Unmount ./fs_nrf52");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}

TEST_F(TestNRF52Fw, nrf52fw_flash_write_segment_from_file_error_on_writing_segment) // NOLINT
{
    const char* segment_path = "segment_1.bin";
    uint32_t    segment_buf[16];
    for (int i = 0; i < sizeof(segment_buf) / sizeof(segment_buf[0]); ++i)
    {
        segment_buf[i] = 0xAA000000 + i;
    }

    {
        this->m_fd = open_file(segment_path, "wb");
        ASSERT_NE(nullptr, this->m_fd);
        fwrite(segment_buf, sizeof(segment_buf[0]), sizeof(segment_buf) / sizeof(segment_buf[0]), this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }

    nrf52fw_tmp_buf_t tmp_buf = { 0 };

    const uint32_t segment_addr = 0x00001000;
    this->m_memSegmentsRead.emplace_back(
        MemSegment(segment_addr, sizeof(segment_buf) / sizeof(segment_buf[0]), segment_buf));
    this->m_memSegmentsWrite.emplace_back(
        MemSegment(segment_addr, sizeof(segment_buf) / sizeof(segment_buf[0]), segment_buf));

    this->m_p_ffs = flashfatfs_mount(this->m_mount_point, GW_NRF_PARTITION, 2, false);
    ASSERT_NE(nullptr, this->m_p_ffs);

    ASSERT_FALSE(nrf52fw_write_segment_from_file(
        this->m_p_ffs,
        segment_path,
        &tmp_buf,
        segment_addr,
        sizeof(segment_buf),
        nullptr));

    flashfatfs_unmount(&this->m_p_ffs);
    this->m_p_ffs = nullptr;

    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_INFO, "Mount partition 'fatfs_nrf52' to the mount point /fs_nrf52");
    TEST_CHECK_LOG_RECORD_FFFS(
        ESP_LOG_INFO,
        "Mount partition 'fatfs_nrf52' as FATFS (SPI-Flash) to the mount point /fs_nrf52");
    TEST_CHECK_LOG_RECORD_FFFS(
        ESP_LOG_INFO,
        "Partition 'fatfs_nrf52' mounted successfully to /fs_nrf52 as FATFS on SPI-Flash");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001000...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_ERROR, "nrf52swd_write_mem failed");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_ERROR, "Failed to write segment 0x00001000 from 'segment_1.bin'");
    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_INFO, "Unmount ./fs_nrf52");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}

TEST_F(TestNRF52Fw, nrf52fw_flash_write_segment_from_file_error_no_file) // NOLINT
{
    const char* segment_path = "segment_1.bin";
    uint32_t    segment_buf[16];
    for (int i = 0; i < sizeof(segment_buf) / sizeof(segment_buf[0]); ++i)
    {
        segment_buf[i] = 0xAA000000 + i;
    }

    nrf52fw_tmp_buf_t tmp_buf = { 0 };

    const uint32_t segment_addr = 0x00001000;
    this->m_memSegmentsRead.emplace_back(
        MemSegment(segment_addr, sizeof(segment_buf) / sizeof(segment_buf[0]), segment_buf));

    this->m_p_ffs = flashfatfs_mount(this->m_mount_point, GW_NRF_PARTITION, 2, false);
    ASSERT_NE(nullptr, this->m_p_ffs);

    ASSERT_FALSE(nrf52fw_write_segment_from_file(
        this->m_p_ffs,
        segment_path,
        &tmp_buf,
        segment_addr,
        sizeof(segment_buf),
        nullptr));

    flashfatfs_unmount(&this->m_p_ffs);
    this->m_p_ffs = nullptr;

    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_INFO, "Mount partition 'fatfs_nrf52' to the mount point /fs_nrf52");
    TEST_CHECK_LOG_RECORD_FFFS(
        ESP_LOG_INFO,
        "Mount partition 'fatfs_nrf52' as FATFS (SPI-Flash) to the mount point /fs_nrf52");
    TEST_CHECK_LOG_RECORD_FFFS(
        ESP_LOG_INFO,
        "Partition 'fatfs_nrf52' mounted successfully to /fs_nrf52 as FATFS on SPI-Flash");
    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_ERROR, "Can't open: ./fs_nrf52/segment_1.bin");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_ERROR, "Can't open 'segment_1.bin'");
    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_INFO, "Unmount ./fs_nrf52");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}

