ruuvi/ruuvi.gateway_esp.c/tests/test_nrf52fw/test_nrf52fw.cpp
TEST_F(TestNRF52Fw, nrf52fw_flash_write_firmware_ok) // NOLINT
{
    nrf52fw_info_t fw_info = { 0 };
    fw_info.fw_ver.version = 0x01020300;
    fw_info.num_segments   = 2;
    {
        nrf52fw_segment_t* p_segment = &fw_info.segments[0];
        snprintf(p_segment->file_name, sizeof(p_segment->file_name), "segment_1.bin");
        p_segment->address = 0x00000000;
        p_segment->size    = 516;
        p_segment->crc     = 0;
    }
    {
        nrf52fw_segment_t* p_segment = &fw_info.segments[1];
        snprintf(p_segment->file_name, sizeof(p_segment->file_name), "segment_2.bin");
        p_segment->address = 0x00001000;
        p_segment->size    = 1028;
        p_segment->crc     = 0;
    }

    {
        nrf52fw_segment_t* p_segment      = &fw_info.segments[0];
        uint32_t*          p_segment_buf1 = (uint32_t*)malloc(p_segment->size);
        ASSERT_NE(nullptr, p_segment_buf1);
        for (unsigned i = 0; i < p_segment->size / sizeof(uint32_t); ++i)
        {
            p_segment_buf1[i] = 0xAA000000 + i;
        }
        this->m_fd = this->open_file(p_segment->file_name, "wb");
        ASSERT_NE(nullptr, this->m_fd);
        fwrite(p_segment_buf1, 1, p_segment->size, this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
        this->m_memSegmentsRead.emplace_back(
            MemSegment(p_segment->address, p_segment->size / sizeof(uint32_t), p_segment_buf1));
        free(p_segment_buf1);
    }

    {
        nrf52fw_segment_t* p_segment      = &fw_info.segments[1];
        uint32_t*          p_segment_buf2 = (uint32_t*)malloc(p_segment->size);
        ASSERT_NE(nullptr, p_segment_buf2);
        for (unsigned i = 0; i < p_segment->size / sizeof(uint32_t); ++i)
        {
            p_segment_buf2[i] = 0xBB000000 + i;
        }
        this->m_fd = this->open_file(p_segment->file_name, "wb");
        ASSERT_NE(nullptr, this->m_fd);
        fwrite(p_segment_buf2, 1, p_segment->size, this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
        this->m_memSegmentsRead.emplace_back(
            MemSegment(p_segment->address, p_segment->size / sizeof(uint32_t), p_segment_buf2));
        free(p_segment_buf2);
    }

    nrf52fw_tmp_buf_t tmp_buf = { 0 };

    this->m_p_ffs = flashfatfs_mount(this->m_mount_point, GW_NRF_PARTITION, 2, false);
    ASSERT_NE(nullptr, this->m_p_ffs);

    ASSERT_TRUE(nrf52fw_flash_write_firmware(this->m_p_ffs, &tmp_buf, &fw_info, nullptr, nullptr));

    flashfatfs_unmount(&this->m_p_ffs);
    this->m_p_ffs = nullptr;

    ASSERT_EQ(2, this->m_memSegmentsWrite.size());
    {
        ASSERT_EQ(this->m_memSegmentsRead[0].segmentAddr, this->m_memSegmentsWrite[0].segmentAddr);
        ASSERT_EQ(this->m_memSegmentsRead[0].data, this->m_memSegmentsWrite[0].data);
    }
    {
        ASSERT_EQ(this->m_memSegmentsRead[1].segmentAddr, this->m_memSegmentsWrite[1].segmentAddr);
        ASSERT_EQ(this->m_memSegmentsRead[1].data, this->m_memSegmentsWrite[1].data);
    }
    {
        ASSERT_EQ(fw_info.fw_ver.version, this->m_uicr_fw_ver);
    }
    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_INFO, "Mount partition 'fatfs_nrf52' to the mount point /fs_nrf52");
    TEST_CHECK_LOG_RECORD_FFFS(
        ESP_LOG_INFO,
        "Mount partition 'fatfs_nrf52' as FATFS (SPI-Flash) to the mount point /fs_nrf52");
    TEST_CHECK_LOG_RECORD_FFFS(
        ESP_LOG_INFO,
        "Partition 'fatfs_nrf52' mounted successfully to /fs_nrf52 as FATFS on SPI-Flash");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Erasing flash memory...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Flash 2 segments");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Flash segment 0: 0x00000000 size=516 from segment_1.bin");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00000000...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00000100...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00000200...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Flash segment 1: 0x00001000 size=1028 from segment_2.bin");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001000...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001100...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001200...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001300...");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Writing 0x00001400...");
    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_INFO, "Unmount ./fs_nrf52");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}

TEST_F(TestNRF52Fw, nrf52fw_flash_write_firmware_ok_with_version_segment) // NOLINT
{
    nrf52fw_info_t fw_info = { 0 };
    fw_info.fw_ver.version = 0x01020300;
    fw_info.num_segments   = 3;
    {
        nrf52fw_segment_t* p_segment = &fw_info.segments[0];
        snprintf(p_segment->file_name, sizeof(p_segment->file_name), "segment_1.bin");
        p_segment->address = 0x00000000;
        p_segment->size    = 516;
        p_segment->crc     = 0;
    }
    {
        nrf52fw_segment_t* p_segment = &fw_info.segments[1];
        snprintf(p_segment->file_name, sizeof(p_segment->file_name), "segment_2.bin");
        p_segment->address = 0x00001000;
        p_segment->size    = 1028;
        p_segment->crc     = 0;
    }
    {
        nrf52fw_segment_t* p_segment = &fw_info.segments[2];
        snprintf(p_segment->file_name, sizeof(p_segment->file_name), "segment_3.bin");
        p_segment->address = 0x10001080;
        p_segment->size    = 4;
        p_segment->crc     = 0;
    }

    {
        nrf52fw_segment_t* p_segment      = &fw_info.segments[0];
        uint32_t*          p_segment_buf1 = (uint32_t*)malloc(p_segment->size);
        ASSERT_NE(nullptr, p_segment_buf1);
        for (unsigned i = 0; i < p_segment->size / sizeof(uint32_t); ++i)
        {
            p_segment_buf1[i] = 0xAA000000 + i;
        }
        this->m_fd = this->open_file(p_segment->file_name, "wb");
        ASSERT_NE(nullptr, this->m_fd);
        fwrite(p_segment_buf1, 1, p_segment->size, this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
        this->m_memSegmentsRead.emplace_back(
            MemSegment(p_segment->address, p_segment->size / sizeof(uint32_t), p_segment_buf1));
        free(p_segment_buf1);
    }

    {
        nrf52fw_segment_t* p_segment      = &fw_info.segments[1];
        uint32_t*          p_segment_buf2 = (uint32_t*)malloc(p_segment->size);
        ASSERT_NE(nullptr, p_segment_buf2);
        for (unsigned i = 0; i < p_segment->size / sizeof(uint32_t); ++i)
        {
            p_segment_buf2[i] = 0xBB000000 + i;
        }
        this->m_fd = this->open_file(p_segment->file_name, "wb");
        ASSERT_NE(nullptr, this->m_fd);
        fwrite(p_segment_buf2, 1, p_segment->size, this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
        this->m_memSegmentsRead.emplace_back(
            MemSegment(p_segment->address, p_segment->size / sizeof(uint32_t), p_segment_buf2));
        free(p_segment_buf2);
    }

    {
        nrf52fw_segment_t* p_segment      = &fw_info.segments[2];
        uint32_t*          p_segment_buf3 = (uint32_t*)malloc(p_segment->size);
        ASSERT_NE(nullptr, p_segment_buf3);
        p_segment_buf3[0] = fw_info.fw_ver.version;
        this->m_fd        = this->open_file(p_segment->file_name, "wb");
        ASSERT_NE(nullptr, this->m_fd);
        fwrite(p_segment_buf3, 1, p_segment->size, this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
        free(p_segment_buf3);
    }

