ruuvi/ruuvi.gateway_esp.c/tests/test_nrf52fw/test_nrf52fw.cpp
    nrf52fw_tmp_buf_t tmp_buf = { 0 };

    uint32_t crc = 0;
    ASSERT_TRUE(nrf52fw_calc_segment_crc(fileno(this->m_fd), &tmp_buf, segment_size, &crc));
    ASSERT_EQ(0x7546C71EU, crc);
    ASSERT_TRUE(esp_log_wrapper_is_empty());
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}

TEST_F(TestNRF52Fw, nrf52fw_calc_segment_crc_fail_file_greater_than_expected) // NOLINT
{
    const char*                 segment_path = "segment_1.bin";
    const size_t                segment_size = 2816;
    std::unique_ptr<uint32_t[]> segment_buf(new uint32_t[segment_size / sizeof(uint32_t)]);
    for (int i = 0; i < segment_size / sizeof(uint32_t); ++i)
    {
        segment_buf[i] = 0xAA000000 + i;
    }

    {
        this->m_fd = this->open_file(segment_path, "wb");
        ASSERT_NE(nullptr, this->m_fd);
        fwrite(segment_buf.get(), 1, segment_size, this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }

    this->m_fd = this->open_file(segment_path, "rb");
    ASSERT_NE(nullptr, this->m_fd);

    nrf52fw_tmp_buf_t tmp_buf = { 0 };

    uint32_t crc = 0;
    ASSERT_FALSE(nrf52fw_calc_segment_crc(fileno(this->m_fd), &tmp_buf, segment_size - sizeof(uint32_t), &crc));
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_ERROR, "offset 2816 greater than segment len 2812");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}

TEST_F(TestNRF52Fw, nrf52fw_calc_segment_crc_fail_bad_length) // NOLINT
{
    const char*                 segment_path = "segment_1.bin";
    const size_t                segment_size = 2816;
    std::unique_ptr<uint32_t[]> segment_buf(new uint32_t[segment_size / sizeof(uint32_t)]);
    for (int i = 0; i < segment_size / sizeof(uint32_t); ++i)
    {
        segment_buf[i] = 0xAA000000 + i;
    }

    {
        this->m_fd = this->open_file(segment_path, "wb");
        ASSERT_NE(nullptr, this->m_fd);
        fwrite(segment_buf.get(), 1, segment_size - 1, this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }

    this->m_fd = this->open_file(segment_path, "rb");
    ASSERT_NE(nullptr, this->m_fd);

    nrf52fw_tmp_buf_t tmp_buf = { 0 };

    uint32_t crc = 0;
    ASSERT_FALSE(nrf52fw_calc_segment_crc(fileno(this->m_fd), &tmp_buf, segment_size, &crc));
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_ERROR, "bad len 255");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}

TEST_F(TestNRF52Fw, nrf52fw_calc_segment_crc_fail_after_file_read_error) // NOLINT
{
    const char*                 segment_path = "segment_1.bin";
    const size_t                segment_size = 2816;
    std::unique_ptr<uint32_t[]> segment_buf(new uint32_t[segment_size / sizeof(uint32_t)]);
    for (int i = 0; i < segment_size / sizeof(uint32_t); ++i)
    {
        segment_buf[i] = 0xAA000000 + i;
    }

    {
        this->m_fd = this->open_file(segment_path, "wb");
        ASSERT_NE(nullptr, this->m_fd);
        fwrite(segment_buf.get(), 1, segment_size, this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }

    this->m_fd = this->open_file(segment_path, "rb");
    ASSERT_NE(nullptr, this->m_fd);

    nrf52fw_tmp_buf_t tmp_buf = { 0 };

    nrf52fw_simulate_file_read_error(true);
    uint32_t crc = 0;
    ASSERT_FALSE(nrf52fw_calc_segment_crc(fileno(this->m_fd), &tmp_buf, segment_size, &crc));
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_ERROR, "nrf52fw_file_read failed");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}

TEST_F(TestNRF52Fw, nrf52fw_check_firmware_ok) // NOLINT
{
    const char*                 segment1_path = "segment_1.bin";
    const size_t                segment1_size = 2816;
    std::unique_ptr<uint32_t[]> segment1_buf(new uint32_t[segment1_size / sizeof(uint32_t)]);
    for (int i = 0; i < segment1_size / sizeof(uint32_t); ++i)
    {
        segment1_buf[i] = 0xAA000000 + i;
    }
    const uint32_t segment1_crc = crc32_le(0, reinterpret_cast<const uint8_t*>(segment1_buf.get()), segment1_size);

    const char*                 segment2_path = "segment_2.bin";
    const size_t                segment2_size = 3500;
    std::unique_ptr<uint32_t[]> segment2_buf(new uint32_t[segment2_size / sizeof(uint32_t)]);
    for (int i = 0; i < segment2_size / sizeof(uint32_t); ++i)
    {
        segment2_buf[i] = 0xAA000000 + i;
    }
    const uint32_t segment2_crc = crc32_le(0, reinterpret_cast<const uint8_t*>(segment2_buf.get()), segment2_size);

    nrf52fw_info_t fw_info = { 0 };
    fw_info.fw_ver.version = 0x03040500;
    fw_info.num_segments   = 2;
    {
        nrf52fw_segment_t* p_segment = &fw_info.segments[0];
        snprintf(p_segment->file_name, sizeof(p_segment->file_name), "%s", segment1_path);
        p_segment->address = 0x00000000;
        p_segment->size    = segment1_size;
        p_segment->crc     = segment1_crc;
    }
    {
        nrf52fw_segment_t* p_segment = &fw_info.segments[1];
        snprintf(p_segment->file_name, sizeof(p_segment->file_name), "%s", segment2_path);
        p_segment->address = 0x00001000;
        p_segment->size    = segment2_size;
        p_segment->crc     = segment2_crc;
    }

    {
        this->m_fd = this->open_file(segment1_path, "wb");
        ASSERT_NE(nullptr, this->m_fd);
        fwrite(segment1_buf.get(), 1, segment1_size, this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }
    {
        this->m_fd = this->open_file(segment2_path, "wb");
        ASSERT_NE(nullptr, this->m_fd);
        fwrite(segment2_buf.get(), 1, segment2_size, this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }

    nrf52fw_tmp_buf_t tmp_buf = { 0 };

    this->m_p_ffs = flashfatfs_mount(this->m_mount_point, GW_NRF_PARTITION, 2, false);
    ASSERT_NE(nullptr, this->m_p_ffs);

    ASSERT_TRUE(nrf52fw_check_firmware(this->m_p_ffs, &tmp_buf, &fw_info));

    flashfatfs_unmount(&this->m_p_ffs);
    this->m_p_ffs = nullptr;

    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_INFO, "Mount partition 'fatfs_nrf52' to the mount point /fs_nrf52");
    TEST_CHECK_LOG_RECORD_FFFS(
        ESP_LOG_INFO,
        "Mount partition 'fatfs_nrf52' as FATFS (SPI-Flash) to the mount point /fs_nrf52");
    TEST_CHECK_LOG_RECORD_FFFS(
        ESP_LOG_INFO,
        "Partition 'fatfs_nrf52' mounted successfully to /fs_nrf52 as FATFS on SPI-Flash");
    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_INFO, "Unmount ./fs_nrf52");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}

