ruuvi/ruuvi.gateway_esp.c/tests/test_nrf52fw/test_nrf52fw.cpp
    this->m_uicr_fw_ver = 0x01020000;

    this->cb_before_updating_cnt                    = 0;
    this->cb_after_updating_cnt                     = 0;
    uint32_t                            cb_prog_cnt = 0;
    ruuvi_nrf52_fw_ver_t                fw_ver      = { 0 };
    const nrf52fw_update_fw_cb_params_t cb_params   = {
          .cb_progress         = &cb_progress,
          .p_param_cb_progress = &cb_prog_cnt,
          .cb_before_updating  = &cb_before_updating,
          .cb_after_updating   = &cb_after_updating,
    };
    ASSERT_FALSE(nrf52fw_update_fw_if_necessary(GW_NRF_PARTITION, false, &cb_params, &fw_ver, true));

    ASSERT_EQ(1, this->cb_before_updating_cnt);
    ASSERT_EQ(1, this->cb_after_updating_cnt);
    ASSERT_EQ(0, cb_prog_cnt);
    ASSERT_EQ(0, this->m_memSegmentsWrite.size());
    ASSERT_EQ(0, this->m_cnt_nrf52swd_erase_all);
    // nrf52fw_read_current_fw_ver should have been invoked to refresh fw_ver after the failure.
    ASSERT_EQ(0x01020000, fw_ver.version);

    esp_log_wrapper_clear();
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}

TEST_F(TestNRF52Fw, nrf52fw_update_firmware_if_necessary__error_write_firmware__with_callbacks) // NOLINT
{
    const char* segment1_path = "segment_1.bin";
    const char* segment2_path = "segment_2.bin";
    const char* segment3_path = "segment_3.bin";

    const size_t segment1_size = 2816;
    const size_t segment2_size = 151016;
    const size_t segment3_size = 24448;

    uint32_t segment1_crc = 0;
    uint32_t segment2_crc = 0;
    uint32_t segment3_crc = 0;

    {
        std::unique_ptr<uint32_t[]> segment1_buf(new uint32_t[segment1_size / sizeof(uint32_t)]);
        for (int i = 0; i < segment1_size / sizeof(uint32_t); ++i)
        {
            segment1_buf[i] = 0xAA000000 + i;
        }
        segment1_crc = crc32_le(0, reinterpret_cast<const uint8_t*>(segment1_buf.get()), segment1_size);
        this->m_fd   = this->open_file(segment1_path, "wb");
        ASSERT_NE(nullptr, this->m_fd);
        fwrite(segment1_buf.get(), 1, segment1_size, this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }

    {
        std::unique_ptr<uint32_t[]> segment2_buf(new uint32_t[segment2_size / sizeof(uint32_t)]);
        for (int i = 0; i < segment2_size / sizeof(uint32_t); ++i)
        {
            segment2_buf[i] = 0xBB000000 + i;
        }
        segment2_crc = crc32_le(0, reinterpret_cast<const uint8_t*>(segment2_buf.get()), segment2_size);
        this->m_fd   = this->open_file(segment2_path, "wb");
        ASSERT_NE(nullptr, this->m_fd);
        fwrite(segment2_buf.get(), 1, segment2_size, this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }

    {
        std::unique_ptr<uint32_t[]> segment3_buf(new uint32_t[segment3_size / sizeof(uint32_t)]);
        for (int i = 0; i < segment3_size / sizeof(uint32_t); ++i)
        {
            segment3_buf[i] = 0xCC000000 + i;
        }
        segment3_crc = crc32_le(0, reinterpret_cast<const uint8_t*>(segment3_buf.get()), segment3_size);
        this->m_fd   = this->open_file(segment3_path, "wb");
        ASSERT_NE(nullptr, this->m_fd);
        fwrite(segment3_buf.get(), 1, segment3_size, this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }

    {
        this->m_fd = this->open_file("info.txt", "w");
        ASSERT_NE(nullptr, this->m_fd);
        fprintf(this->m_fd, "# v1.2.3\n");
        fprintf(this->m_fd, "0x00000000 %u %s 0x%08x\n", (unsigned)segment1_size, segment1_path, segment1_crc);
        fprintf(this->m_fd, "0x00001000 %u %s 0x%08x\n", (unsigned)segment2_size, segment2_path, segment2_crc);
        fprintf(this->m_fd, "0x00026000 %u %s 0x%08x\n", (unsigned)segment3_size, segment3_path, segment3_crc);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }

    this->m_uicr_fw_ver = 0x01020000;
    {
        // Pre-populate a write memSegment so that the subsequent flash write fails.
        const uint32_t stub = 0;
        this->m_memSegmentsWrite.emplace_back(MemSegment(0x00000000, 1, &stub));
    }

    this->cb_before_updating_cnt                    = 0;
    this->cb_after_updating_cnt                     = 0;
    uint32_t                            cb_prog_cnt = 0;
    ruuvi_nrf52_fw_ver_t                fw_ver      = { 0 };
    const nrf52fw_update_fw_cb_params_t cb_params   = {
          .cb_progress         = &cb_progress,
          .p_param_cb_progress = &cb_prog_cnt,
          .cb_before_updating  = &cb_before_updating,
          .cb_after_updating   = &cb_after_updating,
    };
    ASSERT_FALSE(nrf52fw_update_fw_if_necessary(GW_NRF_PARTITION, false, &cb_params, &fw_ver, true));

    ASSERT_EQ(1, this->cb_before_updating_cnt);
    ASSERT_EQ(1, this->cb_after_updating_cnt);
    ASSERT_EQ(1, this->m_memSegmentsWrite.size());
    ASSERT_EQ(1, this->m_cnt_nrf52swd_erase_all);
    // nrf52fw_read_current_fw_ver should have been invoked to refresh fw_ver after the failure;
    // erase_all wipes the UICR, so the version reads back as 0xFFFFFFFF.
    ASSERT_EQ(0xFFFFFFFFU, fw_ver.version);

    esp_log_wrapper_clear();
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}

TEST_F(TestNRF52Fw, nrf52fw_update_firmware_if_necessary__error_read_current_fw_ver_after_flash) // NOLINT
{
    const char* segment1_path = "segment_1.bin";
    const char* segment2_path = "segment_2.bin";
    const char* segment3_path = "segment_3.bin";

    const size_t segment1_size = 2816;
    const size_t segment2_size = 151016;
    const size_t segment3_size = 24448;

    uint32_t segment1_crc = 0;
    uint32_t segment2_crc = 0;
    uint32_t segment3_crc = 0;

    std::unique_ptr<uint32_t[]> segment1_buf(new uint32_t[segment1_size / sizeof(uint32_t)]);
    {
        for (int i = 0; i < segment1_size / sizeof(uint32_t); ++i)
        {
            segment1_buf[i] = 0xAA000000 + i;
        }
        segment1_crc = crc32_le(0, reinterpret_cast<const uint8_t*>(segment1_buf.get()), segment1_size);
        this->m_fd   = this->open_file(segment1_path, "wb");
        ASSERT_NE(nullptr, this->m_fd);
        fwrite(segment1_buf.get(), 1, segment1_size, this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }

    std::unique_ptr<uint32_t[]> segment2_buf(new uint32_t[segment2_size / sizeof(uint32_t)]);
    {
        for (int i = 0; i < segment2_size / sizeof(uint32_t); ++i)
        {
            segment2_buf[i] = 0xBB000000 + i;
        }
        segment2_crc = crc32_le(0, reinterpret_cast<const uint8_t*>(segment2_buf.get()), segment2_size);
        this->m_fd   = this->open_file(segment2_path, "wb");
        ASSERT_NE(nullptr, this->m_fd);
        fwrite(segment2_buf.get(), 1, segment2_size, this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }

    std::unique_ptr<uint32_t[]> segment3_buf(new uint32_t[segment3_size / sizeof(uint32_t)]);
    {
        for (int i = 0; i < segment3_size / sizeof(uint32_t); ++i)
        {
            segment3_buf[i] = 0xCC000000 + i;
        }
        segment3_crc = crc32_le(0, reinterpret_cast<const uint8_t*>(segment3_buf.get()), segment3_size);
        this->m_fd   = this->open_file(segment3_path, "wb");
        ASSERT_NE(nullptr, this->m_fd);
        fwrite(segment3_buf.get(), 1, segment3_size, this->m_fd);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }

    {
        this->m_fd = this->open_file("info.txt", "w");
        ASSERT_NE(nullptr, this->m_fd);
        fprintf(this->m_fd, "# v1.2.3\n");
        fprintf(this->m_fd, "0x00000000 %u %s 0x%08x\n", (unsigned)segment1_size, segment1_path, segment1_crc);
        fprintf(this->m_fd, "0x00001000 %u %s 0x%08x\n", (unsigned)segment2_size, segment2_path, segment2_crc);
        fprintf(this->m_fd, "0x00026000 %u %s 0x%08x\n", (unsigned)segment3_size, segment3_path, segment3_crc);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }

