ruuvi/ruuvi.gateway_esp.c/tests/test_nrf52fw/test_nrf52fw.cpp
    this->m_uicr_fw_ver = 0x01020000;
    this->m_memSegmentsRead.emplace_back(MemSegment(0x00000000, segment1_size / sizeof(uint32_t), segment1_buf.get()));
    this->m_memSegmentsRead.emplace_back(MemSegment(0x00001000, segment2_size / sizeof(uint32_t), segment2_buf.get()));
    this->m_memSegmentsRead.emplace_back(MemSegment(0x00026000, segment3_size / sizeof(uint32_t), segment3_buf.get()));

    this->cb_before_updating_cnt     = 0;
    this->cb_after_updating_cnt      = 0;
    uint32_t             cb_prog_cnt = 0;
    ruuvi_nrf52_fw_ver_t fw_ver      = { 0xDEADBEEF };
    // The post-flash nrf52fw_read_current_fw_ver(&p_tmp_data->cur_fw_ver) is the 3rd UICR read
    // (the 1st is the pre-update version check, the 2nd happens inside nrf52fw_flash_write_firmware
    // to decide whether to write the UICR version). After 2 successful reads the mock flips the
    // simulate-read-error flag so that the 3rd read fails, exercising the post-flash failure
    // branch (cb_after_updating(false)).
    this->m_uicr_fw_ver_num_reads_before_error    = 2;
    const nrf52fw_update_fw_cb_params_t cb_params = {
        .cb_progress         = &cb_progress,
        .p_param_cb_progress = &cb_prog_cnt,
        .cb_before_updating  = &cb_before_updating,
        .cb_after_updating   = &cb_after_updating,
    };
    ASSERT_FALSE(nrf52fw_update_fw_if_necessary(GW_NRF_PARTITION, false, &cb_params, &fw_ver, true));

    ASSERT_EQ(1, this->cb_before_updating_cnt);
    ASSERT_EQ(1, this->cb_after_updating_cnt);
    ASSERT_LT(0, cb_prog_cnt);
    ASSERT_EQ(1, this->m_cnt_nrf52swd_erase_all);
    ASSERT_EQ(3, this->m_memSegmentsWrite.size());
    // After a failed post-flash read, the temporary cur_fw_ver (loaded earlier from UICR
    // before the simulated read error was activated) is copied into p_nrf52_fw_ver.
    ASSERT_EQ(0x01020000U, fw_ver.version);

    // Reset the simulated read error so subsequent calls in tear-down work normally.
    this->m_uicr_fw_ver_simulate_read_error = false;

    esp_log_wrapper_clear();
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}

TEST_F(TestNRF52Fw, nrf52fw_software_reset_ok) // NOLINT
{
    ASSERT_TRUE(nrf52fw_software_reset());
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "nrf52fw_software_reset");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Init SWD");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Deinit SWD");
    ASSERT_TRUE(esp_log_wrapper_is_empty());

    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Fw, nrf52fw_software_reset_failed_nrf52swd_init_swd_failed) // NOLINT
{
    this->m_result_nrf52swd_init = false;
    ASSERT_FALSE(nrf52fw_software_reset());
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "nrf52fw_software_reset");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Init SWD");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_ERROR, "nrf52swd_init failed");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_ERROR, "nrf52fw_init_swd failed");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}

TEST_F(TestNRF52Fw, nrf52fw_software_reset_failed_nrf52swd_debug_run_failed) // NOLINT
{
    this->m_result_nrf52swd_debug_run = false;
    ASSERT_FALSE(nrf52fw_software_reset());
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "nrf52fw_software_reset");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Init SWD");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_ERROR, "nrf52swd_debug_run failed");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Deinit SWD");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
}
/*** Tests for raw-FAT path (new flag_try_using_raw_fatfs parameter) ***********************************/
TEST_F(TestNRF52Fw, nrf52fw_update_firmware_if_necessary__with_raw_fatfs__update_not_needed) // NOLINT
{
    const char*  segment1_path = "segment_1.bin";
    const char*  segment2_path = "segment_2.bin";
    const char*  segment3_path = "segment_3.bin";
    const size_t segment1_size = 2816;
    const size_t segment2_size = 151016;
    const size_t segment3_size = 24448;
    uint32_t     segment1_crc  = 0;
    uint32_t     segment2_crc  = 0;
    uint32_t     segment3_crc  = 0;
    {
        std::unique_ptr<uint32_t[]> segment1_buf(new uint32_t[segment1_size / sizeof(uint32_t)]);
        for (int i = 0; i < segment1_size / sizeof(uint32_t); ++i)
        {
            segment1_buf[i] = 0xAA000000 + i;
        }
        segment1_crc = crc32_le(0, reinterpret_cast<const uint8_t*>(segment1_buf.get()), segment1_size);
        {
            this->m_fd = this->open_file(segment1_path, "wb");
            ASSERT_NE(nullptr, this->m_fd);
            fwrite(segment1_buf.get(), 1, segment1_size, this->m_fd);
            fclose(this->m_fd);
            this->m_fd = nullptr;
        }
    }
    {
        std::unique_ptr<uint32_t[]> segment2_buf(new uint32_t[segment2_size / sizeof(uint32_t)]);
        for (int i = 0; i < segment2_size / sizeof(uint32_t); ++i)
        {
            segment2_buf[i] = 0xBB000000 + i;
        }
        segment2_crc = crc32_le(0, reinterpret_cast<const uint8_t*>(segment2_buf.get()), segment2_size);
        {
            this->m_fd = this->open_file(segment2_path, "wb");
            ASSERT_NE(nullptr, this->m_fd);
            fwrite(segment2_buf.get(), 1, segment2_size, this->m_fd);
            fclose(this->m_fd);
            this->m_fd = nullptr;
        }
    }
    {
        std::unique_ptr<uint32_t[]> segment3_buf(new uint32_t[segment3_size / sizeof(uint32_t)]);
        for (int i = 0; i < segment3_size / sizeof(uint32_t); ++i)
        {
            segment3_buf[i] = 0xCC000000 + i;
        }
        segment3_crc = crc32_le(0, reinterpret_cast<const uint8_t*>(segment3_buf.get()), segment3_size);
        {
            this->m_fd = this->open_file(segment3_path, "wb");
            ASSERT_NE(nullptr, this->m_fd);
            fwrite(segment3_buf.get(), 1, segment3_size, this->m_fd);
            fclose(this->m_fd);
            this->m_fd = nullptr;
        }
    }
    {
        this->m_fd = this->open_file("info.txt", "w");
        ASSERT_NE(nullptr, this->m_fd);
        fprintf(this->m_fd, "# v1.2.3\n");
        fprintf(this->m_fd, "0x00000000 %u %s 0x%08x\n", (unsigned)segment1_size, segment1_path, segment1_crc);
        fprintf(this->m_fd, "0x00001000 %u %s 0x%08x\n", (unsigned)segment2_size, segment2_path, segment2_crc);
        fprintf(this->m_fd, "0x00026000 %u %s 0x%08x\n", (unsigned)segment3_size, segment3_path, segment3_crc);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }
    {
        this->m_uicr_fw_ver = 0x01020300;
    }
    // flag_try_using_raw_fatfs = true; raw mount succeeds (mount_raw_err == ESP_OK by default).
    ASSERT_TRUE(nrf52fw_update_fw_if_necessary(GW_NRF_PARTITION, true, nullptr, nullptr, true));
    ASSERT_EQ(0, this->m_memSegmentsWrite.size());
    ASSERT_EQ(0, this->m_cnt_nrf52swd_erase_all);
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "nRF52 manual reset mode: ON");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Hardware reset nRF52: true");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Hardware reset nRF52: false");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Init SWD");
    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_INFO, "Mount partition 'fatfs_nrf52' to the mount point /fs_nrf52");
    TEST_CHECK_LOG_RECORD_FFFS(
        ESP_LOG_INFO,
        "Try to mount partition 'fatfs_nrf52' as FATFS (raw flash) to the mount point /fs_nrf52");
    TEST_CHECK_LOG_RECORD_FFFS(
        ESP_LOG_INFO,
        "Partition 'fatfs_nrf52' mounted successfully to /fs_nrf52 as FATFS on raw flash");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Firmware on FatFS: v1.2.3");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "### Firmware on nRF52: v1.2.3");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "### Firmware updating is not needed");
    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_INFO, "Unmount ./fs_nrf52");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Deinit SWD");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Hardware reset nRF52: true");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Hardware reset nRF52: false");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "nRF52 manual reset mode: OFF");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}
TEST_F(TestNRF52Fw, nrf52fw_update_firmware_if_necessary__with_raw_fatfs__fallback_to_spiflash_ok) // NOLINT
{
    const char*  segment1_path = "segment_1.bin";
    const char*  segment2_path = "segment_2.bin";
    const char*  segment3_path = "segment_3.bin";
    const size_t segment1_size = 2816;
    const size_t segment2_size = 151016;
    const size_t segment3_size = 24448;
    uint32_t     segment1_crc  = 0;
    uint32_t     segment2_crc  = 0;
    uint32_t     segment3_crc  = 0;
    {
        std::unique_ptr<uint32_t[]> segment1_buf(new uint32_t[segment1_size / sizeof(uint32_t)]);
        for (int i = 0; i < segment1_size / sizeof(uint32_t); ++i)
        {
            segment1_buf[i] = 0xAA000000 + i;
        }
        segment1_crc = crc32_le(0, reinterpret_cast<const uint8_t*>(segment1_buf.get()), segment1_size);
        {
            this->m_fd = this->open_file(segment1_path, "wb");
            ASSERT_NE(nullptr, this->m_fd);
            fwrite(segment1_buf.get(), 1, segment1_size, this->m_fd);
            fclose(this->m_fd);
            this->m_fd = nullptr;
        }
    }
    {
        std::unique_ptr<uint32_t[]> segment2_buf(new uint32_t[segment2_size / sizeof(uint32_t)]);
        for (int i = 0; i < segment2_size / sizeof(uint32_t); ++i)
        {
            segment2_buf[i] = 0xBB000000 + i;
        }
        segment2_crc = crc32_le(0, reinterpret_cast<const uint8_t*>(segment2_buf.get()), segment2_size);
        {
            this->m_fd = this->open_file(segment2_path, "wb");
            ASSERT_NE(nullptr, this->m_fd);
            fwrite(segment2_buf.get(), 1, segment2_size, this->m_fd);
            fclose(this->m_fd);
            this->m_fd = nullptr;
        }
    }
    {
        std::unique_ptr<uint32_t[]> segment3_buf(new uint32_t[segment3_size / sizeof(uint32_t)]);
        for (int i = 0; i < segment3_size / sizeof(uint32_t); ++i)
        {
            segment3_buf[i] = 0xCC000000 + i;
        }
        segment3_crc = crc32_le(0, reinterpret_cast<const uint8_t*>(segment3_buf.get()), segment3_size);
        {
            this->m_fd = this->open_file(segment3_path, "wb");
            ASSERT_NE(nullptr, this->m_fd);
            fwrite(segment3_buf.get(), 1, segment3_size, this->m_fd);
            fclose(this->m_fd);
            this->m_fd = nullptr;
        }
    }
    {
        this->m_fd = this->open_file("info.txt", "w");
        ASSERT_NE(nullptr, this->m_fd);
        fprintf(this->m_fd, "# v1.2.3\n");
        fprintf(this->m_fd, "0x00000000 %u %s 0x%08x\n", (unsigned)segment1_size, segment1_path, segment1_crc);
        fprintf(this->m_fd, "0x00001000 %u %s 0x%08x\n", (unsigned)segment2_size, segment2_path, segment2_crc);
        fprintf(this->m_fd, "0x00026000 %u %s 0x%08x\n", (unsigned)segment3_size, segment3_path, segment3_crc);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }
    {
        this->m_uicr_fw_ver = 0x01020300;
    }
    // flag_try_using_raw_fatfs = true; raw mount fails, spiflash fallback succeeds.
    this->m_mount_info.mount_raw_err = ESP_ERR_NOT_FOUND;
    ASSERT_TRUE(nrf52fw_update_fw_if_necessary(GW_NRF_PARTITION, true, nullptr, nullptr, true));
    ASSERT_EQ(0, this->m_memSegmentsWrite.size());
    ASSERT_EQ(0, this->m_cnt_nrf52swd_erase_all);
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "nRF52 manual reset mode: ON");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Hardware reset nRF52: true");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Hardware reset nRF52: false");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Init SWD");
    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_INFO, "Mount partition 'fatfs_nrf52' to the mount point /fs_nrf52");
    TEST_CHECK_LOG_RECORD_FFFS(
        ESP_LOG_INFO,
        "Try to mount partition 'fatfs_nrf52' as FATFS (raw flash) to the mount point /fs_nrf52");
    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_ERROR, "esp_vfs_fat_rawflash_mount failed, err=261 (ESP_ERR_NOT_FOUND)");
    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_WARN, "Try to mount partition as SPI-Flash FATFS");
    TEST_CHECK_LOG_RECORD_FFFS(
        ESP_LOG_INFO,
        "Mount partition 'fatfs_nrf52' as FATFS (SPI-Flash) to the mount point /fs_nrf52");
    TEST_CHECK_LOG_RECORD_FFFS(
        ESP_LOG_INFO,
        "Partition 'fatfs_nrf52' mounted successfully to /fs_nrf52 as FATFS on SPI-Flash");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Firmware on FatFS: v1.2.3");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "### Firmware on nRF52: v1.2.3");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "### Firmware updating is not needed");
    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_INFO, "Unmount ./fs_nrf52");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Deinit SWD");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Hardware reset nRF52: true");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Hardware reset nRF52: false");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "nRF52 manual reset mode: OFF");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}
TEST_F(TestNRF52Fw, nrf52fw_update_firmware_if_necessary__with_raw_fatfs__both_raw_and_spiflash_fail) // NOLINT
{
    // flag_try_using_raw_fatfs = true; raw mount fails AND fallback spiflash mount also fails.
    this->m_mount_info.mount_raw_err = ESP_ERR_NOT_FOUND;
    this->m_mount_info.mount_err     = ESP_ERR_NOT_FOUND;
    ASSERT_FALSE(nrf52fw_update_fw_if_necessary(GW_NRF_PARTITION, true, nullptr, nullptr, true));
    ASSERT_EQ(0, this->m_memSegmentsWrite.size());
    ASSERT_EQ(0, this->m_cnt_nrf52swd_erase_all);
    ASSERT_FALSE(this->m_mount_info.flag_mounted);
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "nRF52 manual reset mode: ON");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Hardware reset nRF52: true");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Hardware reset nRF52: false");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Init SWD");
    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_INFO, "Mount partition 'fatfs_nrf52' to the mount point /fs_nrf52");
    TEST_CHECK_LOG_RECORD_FFFS(
        ESP_LOG_INFO,
        "Try to mount partition 'fatfs_nrf52' as FATFS (raw flash) to the mount point /fs_nrf52");
    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_ERROR, "esp_vfs_fat_rawflash_mount failed, err=261 (ESP_ERR_NOT_FOUND)");
    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_WARN, "Try to mount partition as SPI-Flash FATFS");
    TEST_CHECK_LOG_RECORD_FFFS(
        ESP_LOG_INFO,
        "Mount partition 'fatfs_nrf52' as FATFS (SPI-Flash) to the mount point /fs_nrf52");
    TEST_CHECK_LOG_RECORD_FFFS(ESP_LOG_ERROR, "esp_vfs_fat_spiflash_mount failed, err=261 (ESP_ERR_NOT_FOUND)");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_ERROR, "flashfatfs_mount failed");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Deinit SWD");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Hardware reset nRF52: true");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "Hardware reset nRF52: false");
    TEST_CHECK_LOG_RECORD_NRF52(ESP_LOG_INFO, "nRF52 manual reset mode: OFF");
    ASSERT_TRUE(esp_log_wrapper_is_empty());
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}
TEST_F(TestNRF52Fw, nrf52fw_update_firmware_if_necessary__with_raw_fatfs__unmount_raw_failed) // NOLINT
{
    const char*  segment1_path = "segment_1.bin";
    const size_t segment1_size = 2816;
    uint32_t     segment1_crc  = 0;
    {
        std::unique_ptr<uint32_t[]> segment1_buf(new uint32_t[segment1_size / sizeof(uint32_t)]);
        for (int i = 0; i < segment1_size / sizeof(uint32_t); ++i)
        {
            segment1_buf[i] = 0xAA000000 + i;
        }
        segment1_crc = crc32_le(0, reinterpret_cast<const uint8_t*>(segment1_buf.get()), segment1_size);
        {
            this->m_fd = this->open_file(segment1_path, "wb");
            ASSERT_NE(nullptr, this->m_fd);
            fwrite(segment1_buf.get(), 1, segment1_size, this->m_fd);
            fclose(this->m_fd);
            this->m_fd = nullptr;
        }
    }
    // info.txt references a segment file that does not exist on disk so that check_firmware
    // fails -> nrf52fw_update_fw_step1 returns false, and the raw-flash unmount path is then
    // exercised on the way back out.
    {
        this->m_fd = this->open_file("info.txt", "w");
        ASSERT_NE(nullptr, this->m_fd);
        fprintf(this->m_fd, "# v1.2.3\n");
        fprintf(this->m_fd, "0x00000000 %u %s 0x%08x\n", (unsigned)segment1_size, "missing.bin", segment1_crc);
        fclose(this->m_fd);
        this->m_fd = nullptr;
    }
    this->m_mount_info.unmount_raw_err = ESP_ERR_NOT_SUPPORTED;
    ASSERT_FALSE(nrf52fw_update_fw_if_necessary(GW_NRF_PARTITION, true, nullptr, nullptr, true));
    ASSERT_FALSE(this->m_mount_info.flag_mounted);
    // Drain all logs and just verify the raw-flash unmount error is emitted.
    bool found_raw_unmount_err = false;
    while (!esp_log_wrapper_is_empty())
    {
        const LogRecord log_record = esp_log_wrapper_pop();
        if ((string("FlashFatFS") == log_record.tag)
            && (string("esp_vfs_fat_rawflash_unmount failed, err=262 (ESP_ERR_NOT_SUPPORTED)")
                == log_record.parsed.msg))
        {
            found_raw_unmount_err = true;
        }
    }
    ASSERT_TRUE(found_raw_unmount_err);
    ASSERT_TRUE(this->m_mem_alloc_trace.is_empty());
}
